[
  {
    "name": "Chromatic Dragonborn",
    "type": "Race",
    "desc": "Dragonborn with chromatic ancestry claim the raw elemental power of the chromatic dragons. The vibrant colors of the chromatics—black, blue, green, red, and white—gleam in their scaled skin and in the deadly energy of their breath weapons. Theirs is the raw elemental fury of the volcano, of biting arctic winds, of raging lightning storms; theirs also is the subtle whisper of swamp and forest, corrosive and toxic.\n\" -f \"***Ability Score Increase.***|Your Constitution score increases by 2, and your Strength score increases by 1.\n\" -f \"***Size.***|You are Medium.\n\" -f \"***Speed.***|Your walking speed is 30 feet.\n\" -f \"***Chromatic Ancestry.***|You trace your ancestry to a chromatic dragon, granting you a special magical affinity. Choose one type of dragon from the Chromatic Ancestry table. This determines the damage type for your other traits as shown in the table.\n\" -f \"**Chromatic Ancestry**|```Dragon | Damage Type\n-------|-------------\nBlack  | Acid\nBlue   | Lightning\nGreen  | Poison\nRed    | Fire\nWhite  | Cold```\n\" -f \"***Breath Weapon.***|When you take the Attack action, you can replace one of your attacks with an exhalation of a magical energy in a 30-foot line that is 5 feet wide. Each creature in the area must make a Dexterity saving throw against a DC equal to 8 + your Constitution modifier + your proficiency bonus. A creature takes 2d8 damage of the type associated with your Chromatic Ancestry on a failed save, and half as much damage on a successful one. This damage increases by 1d8 when you reach 5th level (3d8), 11th level (4d8), and 17th level (5d8).\n\nYou can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest. \n\" -f \"***Draconic Resistance.***|You have resistance to the damage type associated with your Chromatic Ancestry.\n\" -f \"***Chromatic Warding.***|Starting at 3rd level, as an action, you can channel your draconic energies to protect yourself. For 10 minutes, you become immune to the damage type associated with your Chromatic Ancestry. Once you use this trait, you can’t do so again until you finish a long rest."
  },
  {
    "name": "Metallic Dragonborn",
    "type": "Race",
    "desc": "Dragonborn with metallic ancestry lay claim to the unflinching tenacity of the metallic dragons—brass, bronze, copper, gold, and silver—whose hues glint in their scales. Theirs is the fire of hearth and forge, the cold of high mountain air, the spark of inspiration, and the scouring touch of acid that cleanses and purifies.\n\" -f \"***Ability Score Increase.***|Your Constitution score increases by 2, and your Intelligence score increases by 1.\n\" -f \"***Size.***|You are Medium.\n\" -f \"***Speed.***|Your walking speed is 30 feet.\n\" -f \"***Metallic Ancestry.***|You trace your ancestry to a metallic dragon, granting you a special magical affinity. Choose one type of dragon from the Metallic Ancestry table. This determines the damage type for your other traits as shown in the table.\n\" -f \"**Metallic Ancestry**|```Dragon | Damage Type\n-------|-------------\nBrass  | Fire\nBronze | Lightning\nCopper | Acid\nGold   | Fire\nSilver | Cold```\n\" -f \"***Breath Weapon.***|When you take the Attack action, you can replace one of your attacks with an exhalation of a magical energy in a 15-foot cone. Each creature in the area must make a Dexterity saving throw against a DC equal to 8 + your Constitution modifier + your proficiency bonus. A creature takes 2d8 damage of the type associated with your Metallic Ancestry on a failed save, and half as much damage on a successful one. This damage increases by 1d8 when you reach 5th level (3d8), 11th level (4d8), and 17th level (5d8).\n\nYou can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest. \n\" -f \"***Draconic Resistance.***|You have resistance to the damage type associated with your Metallic Ancestry.\n\" -f \"***Metallic Breath Weapon.***|At 3rd level you gain a second breath weapon. When you take the Attack action, you can replace one of your attacks with an exhalation of a magical gas in a 15-foot cone. The save DC for this breath is 8 + your Constitution modifier + your proficiency bonus. When you use this ability, choose one:\n\n- Each creature in the area must succeed on a Strength saving throw or be pushed 20 feet away from you and be knocked prone.\n- Each creature in the area must succeed on a Constitution saving throw or become incapacitated until the start of your next turn.\n\nOnce you use your Metallic Breath Weapon, you can’t do so again until you finish a long rest."
  },
  {
    "name": "Gem Dragonborn",
    "type": "Race",
    "desc": "Dragonborn with gem ancestry partake of the heritage of all gem dragons, who claim to be heirs of the ruby dragon, Sardior—the firstborn of all creation, made by Bahamut and Tiamat in the first days of the First World. The colors and mysterious powers of the gem dragons—amethyst, crystal, emerald, sapphire, and topaz—gleam in their scaled skin and course through their veins. Theirs are the wonders of the mind, the force of will, the brilliant light of insight, the resounding echo of discovery, and the desiccation of despair.\n\" -f \"***Ability Score Increase.***|Your Charisma score increases by 2, and your Intelligence score increases by 1.\n\" -f \"***Size.***|You are Medium.\n\" -f \"***Speed.***|Your walking speed is 30 feet.\n\" -f \"***Gem Ancestry.***|You trace your ancestry to a gem dragon, granting you a special magical affinity. Choose one type of dragon from the Gem Ancestry table. This determines the damage type for your other traits as shown in the table.\n\" -f \"**Gem Ancestry**|```Dragon   | Damage Type\n---------|-------------\nAmethyst | Force\nCrystal  | Radiant\nEmerald  | Psychic\nSapphire | Thunder\nTopaz    | Necrotic```\n\" -f \"***Breath Weapon.***|When you take the Attack action, you can replace one of your attacks with an exhalation of a magical energy in a 15-foot cone. Each creature in the area must make a Dexterity saving throw against a DC equal to 8 + your Constitution modifier + your proficiency bonus. A creature takes 2d8 damage of the type associated with your Gem Ancestry on a failed save, and half as much damage on a successful one. This damage increases by 1d8 when you reach 5th level (3d8), 11th level (4d8), and 17th level (5d8).\n\nYou can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.\n\" -f \"***Draconic Resistance.***|You have resistance to the damage type associated with your Gem Ancestry.\n\" -f \"***Psionic Mind.***|You can telepathically speak to any creature you can see within 30 feet of you. You don’t need to share a language with the creature, but the creature must be able to understand at least one language. Your communication doesn’t give the creature the ability to respond to you telepathically.\n\" -f \"***Gem Flight.***|Starting at 3rd level, you can use your bonus action to temporarily summon an array of spectral gems that match your Gem Ancestry in the shape of wings that last for 1 minute. For the duration, you gain a flying speed equal to your walking speed and can hover. Once you use this trait, you can’t do so again until you finish a long rest."
  }
]
