[
{"name":"Dhampir","type":"Race","desc":"Poised between the worlds of the living and the dead, dhampirs retain their grip on life yet are endlessly tested by vicious hungers. Their ties to the undead grant dhampirs a taste of a vampire’s deathless prowess in the form of increased speed, darkvision, and a life-draining bite. With unique insights into the nature of the undead, many dhampirs turn to the lives of adventurers and monster hunters. Their reasons are often deeply personal. Some seek danger, imagining monsters as personifications of their own hungers. Others pursue revenge against whatever turned them into a dhampir. And still others embrace the solitude of the hunt, striving to distance themselves from those who’d tempt their hunger.\n\" -f \"Your Dhampir gains the following traits:\n\" -f \"***Ability Score Increase.***| Your Constitution score increases by 2, and your Dexterity score increases by 1.\n\" -f \"***Size.***| Your size is Medium.\n\" -f \"***Speed.***| Your base walking speed is 35 feet.\n\" -f \"***Darkvision.***| You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light.\n\" -f \"***Languages.***| You can speak, read, and write Common and one other language of your choice.\n\" -f \"***Spider Climb.***| You have a climbing speed equal to your walking speed. In addition, at 3rd level, you can move up, down, and across vertical surfaces and upside down along ceilings, while leaving your hands free.\n\" -f \"***Vampiric Bite.***| Your fanged bite is a natural weapon, which counts as a simple melee weapon with which you are proficient. You add your Constitution modifier, instead of your strength, to the attack and damage rolls when you attack with your bite. Your bite deals 1d6 piercing damage on a hit. While you are missing half or more of your hit points, you have advantage on attack rolls you make with this bite.\nOnce per turn when you use your bite and hit a creature that isn’t a Construct or an Undead, you can regain hit points equal to 1d4 + your Constitution modifier.\nYou can regain hit points with your bite a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."},
{"name":"Hexblood","type":"Race","desc":"Where wishing fails, ancient magic can offer a heart’s desire—at least, for a time. Hexbloods are individuals infused with eldritch magic, fey energy, or mysterious witchcraft. Some who enter into bargains with hags gain their deepest wishes but eventually find themselves transformed. These changes evidence a hag’s influence: ears that split in forked points, skin in wild shades, lengthy hair that regrows if cut, and an irremovable living crown. Along with these marks, hexbloods manifest hag-like traits, such as long life, darkvision, and a variety of magical methods to beguile the senses and avoid the same.\n\" -f \"While many hexbloods gain their lineage after making a deal with a hag, others reveal their nature as they age—particularly if a hag influenced them early in life or even before their birth. Many hexbloods turn to lives of adventure, seeking to discover the mysteries of their magic, to forge a connection with their fey natures, or to avoid a hag that obsesses over them.\n\" -f \"Your Hexblood gains the following traits:\n\" -f \"***Ability Score Increase.***| Your Charisma score increases by 2, and one other ability score of your choice increases by 1. \n\" -f \"***Size.***| Your size is Medium. \n\" -f \"***Speed.***| Your base walking speed is 30 feet. \n\" -f \"***Darkvision.***| You can see in dim light within 60  feet of you as if it were bright light and in  darkness as if it were dim light. \n\" -f \"***Fey Resilience.***| You have advantage on saving  throws you make to avoid or end the charmed condition on yourself. \n\" -f \"***Hex Magic.***| You can cast the *disguise self* and  *hex* spells with this trait. Intelligence, Wisdom, or  Charisma is your spellcasting ability for these spells (you choose). Once you cast either of these spells with this trait, you  can’t cast that spell with it again until you finish a long rest. You can also cast these spells using any spells slots you have. \n\" -f \"***Magic Token.***| As an action, you can harmlessly pull out one of your nails, a tooth, or a lock of hair. This token is imbued with magic until you finish a long rest. While the token is imbued in this way, you can use an action to send a telepathic message to the creature holding or carrying the token, as long as you are on the same plane of existence and are within 10 miles of it. The message can contain up to twenty-five words.\nIn addition, while you are within 10 miles of the token, you can use an action to enter a trance for 1 minute, during which you can see and hear from the token as if you were located where it is. While you are using your senses at the token’s location, you are blinded and deafened in regard to your own surroundings. Afterward, the token is harmlessly destroyed.\nOnce you create a token using this feature, you can’t do so again until you finish a long rest, at which point your missing part regrows. \n\" -f \"***Languages.***| You can speak, read, and write Common and one other language of your choice."},
{"name":"Reborn","type":"Race","desc":"Death isn’t always the end. The reborn exemplify this, being individuals who have died yet, somehow, still live. Some reborn exhibit the scars of fatal fates, their ashen flesh, missing limbs, or bloodless veins making it clear that they’ve been touched by death. Other reborn are marvels of magic or science, being stitched together from disparate beings or bearing mysterious minds in manufactured bodies. Whatever their origins, reborn know a new life and seek experiences and answers all their own. \n\" -f \"Your Reborn gains the following traits: \n\" -f \"***Ability Score Increase.***| Your Constitution score increases by 2, and one other ability score of your choice increases by 1. \n\" -f \" ***Size.***| Your size is Medium. \n\" -f \"***Speed.***| Your base walking speed is 30 feet. \n\" -f \"***Darkvision.***| You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. \n\" -f \" ***Deathless Nature.***| You have escaped death, a fact represented by the following benefits:\n- You have advantage on saving throws against disease and being poisoned, and you have resistance to poison damage.\n- You have advantage on death saving throws.\n- You don’t need to eat, drink, or breathe.\n- You don’t need to sleep, and magic can’t put you to sleep. You can finish a long rest in 4 hours if you spend those hours in an inactive, motionless state, during which you retain consciousness. \n\" -f \" ***Knowledge from a Past Life.***| You temporarily remember sporadic glimpses of the past, perhaps faded memories from ages ago or a  previous life. When you make an ability check that uses a skill, you can roll a d6 and add the number rolled to the check. You can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest. \n\" -f \" ***Languages.***| You can speak, read, and write Common and one other language of your choice."},
{"name":"Fairy","type":"Race","desc":"The Feywild is home to many fantastic peoples, including fairies. Fairies are a wee folk, but not nearly as much so as their pixie and sprite friends.\nInfused with the magic of the Feywild, fairies share a few commonalities with one another but can differ widely in appearance, behavior, and attitude. Many fairies have a special physical characteristic that sets them apart from other creatures of their kind. For your fairy, roll on the Fey Characteristic table or choose an option from it. The Feywild is a wild place, so come up with your own characteristic if none of these fit your character. \n\" -f \"You have the following racial traits. \n\" -f \"***Ability Score Increase.***| Your Dexterity score increases by 2, and your Wisdom score increases by 1. \n\" -f \"***Creature Type.***| You are a Fey. \n\" -f \"***Size.***| You are Small. \n\" -f \"***Speed.***| Your walking speed is 30 feet. \n\" -f \"***Fairy Flight.***| You have a flying speed equal to your walking speed and can hover. This flight is magical and does not require the use of your wings (if you have them). \n\" -f \"***Fairy Magic.***| You know the *druidcraft* and *faerie fire* spells. You can cast *faerie fire* without expending a spell slot, and you must finish a long rest before you can cast it this way again. You can also cast this spell using any spell slots you have. Your spellcasting ability for these spells is your choice of Intelligence, Wisdom, or Charisma. \n\" -f \"***Fey Passage.***| You can squeeze through a space as narrow as 1 inch wide. \n\" -f \"***Languages.***| You can speak, read, and write Common and one other language of your choice."},
{"name":"Hobgoblin of the Feywild","type":"Race","desc":"Hobgoblins trace their origins to the Feywild, where they first appeared with their goblin and bugbear kin. That history has left its mark, for though hobgoblins are found throughout the Material Plane, they continue to channel an aspect of the Feywild’s rule of reciprocity, which creates a mystical bond between the giver and the receiver of a gift.\nOn some worlds, such bonds lead hobgoblins to form communities with deep ties to each other. In the Forgotten Realms, vast hobgoblin legions have emerged, with ranks upon ranks of devoted soldiers noteworthy for how effective they are at fighting as a unit.\nHobgoblins are generally taller than their goblin cousins but not quite as big as bugbears. They have curved, pointed ears and noses that turn red or blue during displays of emotion. \n\" -f \"You have the following racial traits. \n\" -f \"***Ability Score Increase.***| Your Constitution score increases by 2, and your Wisdom score increases by 1. \n\" -f \"***Creature Type.***| You are a Humanoid. \n\" -f \"***Size.***| You are Medium. \n\" -f \"***Speed.***| Your walking speed is 30 feet. \n\" -f \"***Darkvision.***| You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray. \n\" -f \"***Fey Ancestry.***| You have advantage on saving throws you make to avoid or end the charmed condition on yourself. \n\" -f \"***Fey Gift.***| You can use this trait to take the Help action as a bonus action, and you can do so a number of times equal to your proficiency bonus. You regain all expended uses when you finish a long rest.Starting at 3rd level, choose one of the options below each time you take the Help action, whether as a bonus action or an action:\n- **Hospitality.** You and the target of your Help action each gain a number of temporary hit points equal to 1d6 plus your proficiency bonus.\n- **Passage.** You and the target of your Help action each increase your walking speeds by 10 feet until the start of your next turn.\n- **Spite.** Until the start of your next turn, the first time you or the target of your Help action hits a creature with an attack roll, that creature has disadvantage on the next attack roll that it makes within the next minute. \n\" -f \"***Fortune from the Many.***| If you miss with an attack roll or fail an ability check or a saving throw, you can draw on your bonds of reciprocity to gain a bonus to the roll equal to the number of allies you can see within 30 feet of you (maximum bonus of +5). You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses you finish a long rest. \n\" -f \"***Languages.***| You can speak, read, and write Common and one other language of your choice."},
]
