[
{"name":"Dhampir","type":"Race","desc":"Poised between the worlds of the living and the dead, dhampirs retain their grip on life yet are endlessly tested by vicious hungers. Their ties to the undead grant dhampirs a taste of a vampire’s deathless prowess in the form of increased speed, darkvision, and a life-draining bite. With unique insights into the nature of the undead, many dhampirs turn to the lives of adventurers and monster hunters. Their reasons are often deeply personal. Some seek danger, imagining monsters as personifications of their own hungers. Others pursue revenge against whatever turned them into a dhampir. And still others embrace the solitude of the hunt, striving to distance themselves from those who’d tempt their hunger.\nYour Dhampir gains the following traits.\n\" -f \"***Ability Score Increase.***| Your Constitution score increases by 2, and your Dexterity score increases by 1.\n\" -f \"***Size.***| Your size is Medium.\n\" -f \"***Speed.***| Your base walking speed is 35 feet.\n\" -f \"***Darkvision.***| You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light.\n\" -f \"***Languages.***| You can speak, read, and write Common and one other language of your choice.\n\" -f \"***Spider Climb.***| You have a climbing speed equal to your walking speed. In addition, at 3rd level, you can move up, down, and across vertical surfaces and upside down along ceilings, while leaving your hands free.\n\" -f \"***Vampiric Bite.***| Your fanged bite is a natural weapon, which counts as a simple melee weapon with which you are proficient. You add your Constitution modifier, instead of your strength, to the attack and damage rolls when you attack with your bite. Your bite deals 1d6 piercing damage on a hit. While you are missing half or more of your hit points, you have advantage on attack rolls you make with this bite.\nOnce per turn when you use your bite and hit a creature that isn’t a Construct or an Undead, you can regain hit points equal to 1d4 + your Constitution modifier.\nYou can regain hit points with your bite a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."},
{"name":"Hexblood","type":"Race","desc":"Where wishing fails, ancient magic can offer a heart’s desire—at least, for a time. Hexbloods are individuals infused with eldritch magic, fey energy, or mysterious witchcraft. Some who enter into bargains with hags gain their deepest wishes but eventually find themselves transformed. These changes evidence a hag’s influence: ears that split in forked points, skin in wild shades, lengthy hair that regrows if cut, and an irremovable living crown. Along with these marks, hexbloods manifest hag-like traits, such as long life, darkvision, and a variety of magical methods to beguile the senses and avoid the same.\nWhile many hexbloods gain their lineage after making a deal with a hag, others reveal their nature as they age—particularly if a hag influenced them early in life or even before their birth. Many hexbloods turn to lives of adventure, seeking to discover the mysteries of their magic, to forge a connection with their fey natures, or to avoid a hag that obsesses over them.\nYour Hexblood gains the following traits.\n\" -f \"***Ability Score Increase.***| Your Charisma score increases by 2, and one other ability score of your choice increases by 1. \n\" -f \"***Size.***| Your size is Medium. \n\" -f \"***Speed.***| Your base walking speed is 30 feet. \n\" -f \"***Darkvision.***| You can see in dim light within 60  feet of you as if it were bright light and in  darkness as if it were dim light. \n\" -f \"***Fey Resilience.***| You have advantage on saving  throws you make to avoid or end the charmed condition on yourself. \n\" -f \"***Hex Magic.***| You can cast the *disguise self* and  *hex* spells with this trait. Intelligence, Wisdom, or  Charisma is your spellcasting ability for these spells (you choose). Once you cast either of these spells with this trait, you  can’t cast that spell with it again until you finish a long rest. You can also cast these spells using any spells slots you have. \n\" -f \"***Magic Token.***| As an action, you can harmlessly pull out one of your nails, a tooth, or a lock of hair. This token is imbued with magic until you finish a long rest. While the token is imbued in this way, you can use an action to send a telepathic message to the creature holding or carrying the token, as long as you are on the same plane of existence and are within 10 miles of it. The message can contain up to twenty-five words.\nIn addition, while you are within 10 miles of the token, you can use an action to enter a trance for 1 minute, during which you can see and hear from the token as if you were located where it is. While you are using your senses at the token’s location, you are blinded and deafened in regard to your own surroundings. Afterward, the token is harmlessly destroyed.\nOnce you create a token using this feature, you can’t do so again until you finish a long rest, at which point your missing part regrows. \n\" -f \"***Languages.***| You can speak, read, and write Common and one other language of your choice."},
{"name":"Reborn","type":"Race","desc":"Death isn’t always the end. The reborn exemplify this, being individuals who have died yet, somehow, still live. Some reborn exhibit the scars of fatal fates, their ashen flesh, missing limbs, or bloodless veins making it clear that they’ve been touched by death. Other reborn are marvels of magic or science, being stitched together from disparate beings or bearing mysterious minds in manufactured bodies. Whatever their origins, reborn know a new life and seek experiences and answers all their own.\nYour Reborn gains the following traits. \n\" -f \"***Ability Score Increase.***| Your Constitution score increases by 2, and one other ability score of your choice increases by 1. \n\" -f \" ***Size.***| Your size is Medium. \n\" -f \"***Speed.***| Your base walking speed is 30 feet. \n\" -f \"***Darkvision.***| You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. \n\" -f \" ***Deathless Nature.***| You have escaped death, a fact represented by the following benefits:\n- You have advantage on saving throws against disease and being poisoned, and you have resistance to poison damage.\n- You have advantage on death saving throws.\n- You don’t need to eat, drink, or breathe.\n- You don’t need to sleep, and magic can’t put you to sleep. You can finish a long rest in 4 hours if you spend those hours in an inactive, motionless state, during which you retain consciousness. \n\" -f \" ***Knowledge from a Past Life.***| You temporarily remember sporadic glimpses of the past, perhaps faded memories from ages ago or a  previous life. When you make an ability check that uses a skill, you can roll a d6 and add the number rolled to the check. You can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest. \n\" -f \" ***Languages.***| You can speak, read, and write Common and one other language of your choice."},
{"name":"Fairy","type":"Race","desc":"The Feywild is home to many fantastic peoples, including fairies. Fairies are a wee folk, but not nearly as much so as their pixie and sprite friends.\nInfused with the magic of the Feywild, fairies share a few commonalities with one another but can differ widely in appearance, behavior, and attitude. Many fairies have a special physical characteristic that sets them apart from other creatures of their kind. For your fairy, roll on the Fey Characteristic table or choose an option from it. The Feywild is a wild place, so come up with your own characteristic if none of these fit your character.\nYou have the following racial traits. \n\" -f \"***Ability Score Increase.***| Your Dexterity score increases by 2, and your Wisdom score increases by 1. \n\" -f \"***Creature Type.***| You are a Fey. \n\" -f \"***Size.***| You are Small. \n\" -f \"***Speed.***| Your walking speed is 30 feet. \n\" -f \"***Fairy Flight.***| You have a flying speed equal to your walking speed and can hover. This flight is magical and does not require the use of your wings (if you have them). \n\" -f \"***Fairy Magic.***| You know the *druidcraft* and *faerie fire* spells. You can cast *faerie fire* without expending a spell slot, and you must finish a long rest before you can cast it this way again. You can also cast this spell using any spell slots you have. Your spellcasting ability for these spells is your choice of Intelligence, Wisdom, or Charisma. \n\" -f \"***Fey Passage.***| You can squeeze through a space as narrow as 1 inch wide. \n\" -f \"***Languages.***| You can speak, read, and write Common and one other language of your choice."},
{"name":"Hobgoblin of the Feywild","type":"Race","desc":"Hobgoblins trace their origins to the Feywild, where they first appeared with their goblin and bugbear kin. That history has left its mark, for though hobgoblins are found throughout the Material Plane, they continue to channel an aspect of the Feywild’s rule of reciprocity, which creates a mystical bond between the giver and the receiver of a gift.\nOn some worlds, such bonds lead hobgoblins to form communities with deep ties to each other. In the Forgotten Realms, vast hobgoblin legions have emerged, with ranks upon ranks of devoted soldiers noteworthy for how effective they are at fighting as a unit.\nHobgoblins are generally taller than their goblin cousins but not quite as big as bugbears. They have curved, pointed ears and noses that turn red or blue during displays of emotion.\nYou have the following racial traits. \n\" -f \"***Ability Score Increase.***| Your Constitution score increases by 2, and your Wisdom score increases by 1. \n\" -f \"***Creature Type.***| You are a Humanoid. \n\" -f \"***Size.***| You are Medium. \n\" -f \"***Speed.***| Your walking speed is 30 feet. \n\" -f \"***Darkvision.***| You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray. \n\" -f \"***Fey Ancestry.***| You have advantage on saving throws you make to avoid or end the charmed condition on yourself. \n\" -f \"***Fey Gift.***| You can use this trait to take the Help action as a bonus action, and you can do so a number of times equal to your proficiency bonus. You regain all expended uses when you finish a long rest.Starting at 3rd level, choose one of the options below each time you take the Help action, whether as a bonus action or an action:\n- **Hospitality.** You and the target of your Help action each gain a number of temporary hit points equal to 1d6 plus your proficiency bonus.\n- **Passage.** You and the target of your Help action each increase your walking speeds by 10 feet until the start of your next turn.\n- **Spite.** Until the start of your next turn, the first time you or the target of your Help action hits a creature with an attack roll, that creature has disadvantage on the next attack roll that it makes within the next minute. \n\" -f \"***Fortune from the Many.***| If you miss with an attack roll or fail an ability check or a saving throw, you can draw on your bonds of reciprocity to gain a bonus to the roll equal to the number of allies you can see within 30 feet of you (maximum bonus of +5). You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses you finish a long rest. \n\" -f \"***Languages.***| You can speak, read, and write Common and one other language of your choice."},
{"name":"Owlfolk","type":"Race","desc":"Distant kin of giant owls, owlfolk come in many shapes and sizes, from petite and fluffy to wide-winged and majestic. Owlfolk have arms and legs like other Humanoids, as well as wings that extend from their back and shoulders.\nBecause of their ancestral tie to the Feywild, owlfolk can innately see the magic of their surroundings. Like owls, owlfolk are graced with feathers that make no sound when they move or fly, making it easy for them to sneak up on you in the library.\nYour owlfolk character might be nocturnal. Or perhaps your character is simply prone to rise later, embodying the common nickname of night owl.\nYou have the following racial traits. \n\" -f \"***Ability Score Increase.***| Your Wisdom score increases by 2, and your Dexterity score increases by 1. \n\" -f \"***Creature Type.***| You are a Humanoid. \n\" -f \"***Size.***| You are Medium. \n\" -f \"***Speed.***| Your walking speed is 30 feet. \n\" -f \"***Darkvision.***| You can see in dim light within 90 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray. \n\" -f \"***Magic Sight.***| Your keen senses can focus to see the presence of magic. You gain the ability to cast the detect magic spell, but only as a ritual. Your spellcasting ability for this spell is your choice of Intelligence, Wisdom, or Charisma. You can also cast this spell normally with any spell slots you have. \n\" -f \"***Nimble Flight.***| Thanks to your wings, you have a flying speed equal to your walking speed. When you fall, you can use your reaction to make a Dexterity saving throw (DC 10) to stop falling and fly in place until the start of your next turn. \n\" -f \"***Silent Feathers.***| You have proficiency in the Stealth skill. \n\" -f \"***Languages.***| You can speak, read, and write Common and one other language of your choice."},
{"name":"Rabbitfolk","type":"Race","desc":"Bounding across the wilds, rabbitfolk from the Feywild embody a spirit of freedom and travel.\nRabbitfolk are bipedal, with the characteristic long feet of the animal they resemble and fur in a variety of colors. They share the keen senses and powerful legs of leporine creatures and are full of energy, like a wound-up spring. Rabbitfolk are blessed with a little fey luck, and they often find themselves a few fortunate feet away from dangers during adventures.\nYou have the following racial traits. \n\" -f \"***Ability Score Increase.***| Your Dexterity score increases by 2, and one other ability score of your choice increases by 1. \n\" -f \"***Creature Type.***| You are a Humanoid. \n\" -f \"***Size.***| You are Medium or Small. You choose the size when you gain this race. \n\" -f \"***Speed.***| Your walking speed is 40 feet. \n\" -f \"***Leporine Senses.***| You have proficiency in the Perception skill. \n\" -f \"***Lucky Footwork.***| When you fail a Dexterity saving throw, you can use your reaction to roll a d4 and add it to the result, potentially turning the failure into a success. \n\" -f \"***Languages.***| You can speak, read, and write Common and one other language of your choice."},
{"name":"Viashino","type":"Race","desc":"Many reptiles derive their body warmth and energy from the sun, but the humanoid viashino are fueled by an inner fire of zeal. Open with their emotions, viashino can be hot-tempered, but they are also quick to their hissing laughter. And they easily form close bonds of friendship. They are fierce warriors and passionate advocates for their guilds and causes.\nYour viashino character has the following traits.\n\" -f \"***Ability Score Increase.***| Your Dexterity score increases by 2, and your Strength score increases by 1.\n\" -f \"***Age.***| Viashino mature quickly, reaching adulthood in their early teens. They live violent lives and rarely die of old age, but they would rarely live past 60 anyway.\n\" -f \"***Alignment.***| Viashino strongly tend toward chaotic alignments. They have no particular inclination toward good or evil.\n\" -f \"***Size.***| Viashino are about as tall as humans, but they have lithe, wiry frames. Your size is Medium.\n\" -f \"***Speed.***| Your base walking speed is 30 feet.\n\" -f \"***Bite.***| Your fanged maw is a natural weapon, which you can use to make unarmed strikes. If you hit with it, you deal piercing damage equal to 1d4 + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike.\n\" -f \"***Lashing Tail.***| Your semi-prehensile tail is tipped with a bony blade. Immediately after a creature within 5 feet of you deals damage to you with a melee attack, you can use your reaction to make an unarmed strike against that creature with your tail. If you hit, you deal slashing damage equal to 1d4 + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike.\n\" -f \"***Wiry Frame.***| You gain proficiency in the Acrobatics or the Stealth skill (your choice).\n\" -f \"***Languages.***| You can speak, read, and write Common and Draconic."},
{"name":"Tiefling Variant","type":"Subrace","desc":"As presented in the Player’s Handbook, all members of the tiefling race share some manner of diabolic origin. The following option allows you to instead create a tiefling with a demonic tie. All tieflings gain the following traits from the standard tiefling race of the *Player’s Handbook:*\n- Age\n- Alignment\n- Size\n- Speed\n- Darkvision\n\" -f \"Additionally, the following traits are modified from the *Player’s Handbook:*\n- ***Ability Score Increase.*** Your Charisma score increases by 2.\n- ***Languages.*** You can speak, read, and write Common.\n\" -f \"**Subraces**| This variant introduces new subraces for the tiefling. Each subrace offers traits in addition to the ones noted above. The race presented in the Player’s Handbook is the infernal tiefling, which is summarized here for ease of reference.\n\" -f \"**Infernal Tiefling**| An infernal tiefling draws upon the power of the Nine Hells and its diabolic masters. These tieflings have the following additional features.\n ***Ability Score Increase.*** Your Intelligence score increases by 1.\n ***Hellish Resistance.*** As described in the Player’s Handbook.\n ***Infernal Legacy.*** As described in the Player’s Handbook.\n ***Languages.*** You can speak, read, and write Infernal.\n\" -f \"**Abyssal Tiefling**| All abyssal tieflings trace their bloodline to the demons of the Abyss. These tieflings have the following additional features.\n ***Ability Score Increase.*** Your Constitution score increases by 1.\n ***Abyssal Arcana.*** When you finish a long rest, you gain the ability to cast cantrips and spells randomly determined from a short list. At 1st level, you can cast a cantrip, a 1st-level spell at 3rd level, and a 2nd-level spell at 5th level.\nYou can cast a spell gained from this trait once per long rest, and you can cast a cantrip at will. For 1st-level spells whose effect changes if cast using a higher spell slot, you cast the spell as if using a 2nd-level slot.\nAt the end of a long rest, you lose the spells previously granted by this feature. You replace those spells by rolling for new ones on the Abyssal Arcana Spells table. Roll separately for each spell. If you roll the same spell you gained at the end of your previous long rest, roll until you get a different result.\n\" -f \"**Abyssal Arcana Spells**|```d6 | 1st level          | 3rd level          | 5th level      \n---|--------------------|--------------------|---------------\n1  | *Dancing lights*   | *Burning hands*    | *Alter self*   \n2  | *True strike*      | *Charm person*     | *Darkness*     \n3  | *Light*            | *Magic missile*    | *Invisibility* \n4  | *Message*          | *Cure wounds*      | *Levitate*     \n5  | *Spare the dying*  | *Hideous laughter* | *Mirror image* \n6  | *Prestidigitation* | *Thunderwave*      | *Spider climb* \n```\n\" -f \"***Abyssal Fortitude.*** Your hit point maximum increases by half your level (minimum 1).\n ***Languages.*** You can speak, read, and write Abyssal."},
{"name":"Revenant","type":"Subrace","desc":"Having met a cruel and undeserved end, you have returned to the realm of the living. As a revenant, you thirst for revenge against those who wronged you in life, or seek to complete a final, critical task you left unfinished.\nThe revenant subrace can be applied to any race that has a subrace, and replaces that race’s existing subrace options. Alternatively, you can apply this new subrace to a race without subrace options using the modification options provided below.\nYour DM might also allow you to take this subrace for a slain character. In that case, your character rises from the dead with its original subrace replaced (or with the necessary modifications made to its base traits), filled with a determination to seek vengeance or complete its mission.\n\" -f \"**Racial Adjustments**| For races that don’t have subrace options, taking on the revenant subrace means making changes to your character’s base traits, as follows. (This playtest article provides options only for human and dragonborn characters. Because half-elves and half-orcs have no subrace options, they shouldn’t be used with these revenant subrace rules.)\n\" -f \" ***Human Revenant.*** If you want to play a human revenant, modify the human’s Ability Score Increase trait to the following: Two different ability scores of your choice increase by 1. If you use the variant human traits, remove the Skills trait and the Feat trait.\n ***Dragonborn Revenant.*** If you want to play a dragonborn revenant, modify the dragonborn’s Ability Score Increase trait to the following: Your Strength score increases by 1, and your Charisma score increases by 1. Additionally, your Draconic Ancestry trait uses necrotic damage as its damage type, replacing the damage type that applies to your breath weapon and your damage resistance. Tiefling Revenant. A prior installment of Unearthed Arcana outlined two tiefling variants that make use of subraces. Use that article to make a tiefling revenant, replacing the subrace options with the revenant subrace options.\n\" -f \"***Ability Score Increase***| Your Constitution score increases by 1.\n\" -f \"***Relentless Nature***| Your DM assigns a goal to you—typically, one related to your character’s death. The goal must be a specific task you can complete, such as slaying an enemy or liberating an area and its people. Until you fulfill that goal, you gain the following benefits:\n- If you are below half your hit point maximum at the start of your turn, you regain 1 hit point.\n- If you die, you return to life 24 hours after death. If your body is destroyed, you reform within 1 mile of the place of your death at a spot determined by the DM. If your equipment was also destroyed, you do not regain it.\n- You know the distance and direction between you and any creature involved in your goal, such as a person you seek vengeance against or someone you pledged to defend. This awareness fails if the creature is on another plane of existence.\nWhen your goal is complete, you finally find rest. You die and cannot be restored to life."},
{"name":"Elf Subraces","type":"Subrace","desc":"When you choose the subrace of your elf character, you can choose one of the following options, in addition to those in the Player’s Handbook.\n\" -f \"**Avariel**|The avariel are winged elves. These rare creatures were more common when the worlds of the multiverse were young, but frequent conflicts with dragons much reduced the winged elves’ number. Still, a few colonies persist here and there in the Material Plane and on the Plane of Air.\n***Flight.*** You have a flying speed of 30 feet. To use this speed, you can’t be wearing medium or heavy armor.\n***Languages.*** You can speak, read, and write Auran.\n\" -f \"**Grugach**|The grugach of the world of Greyhawk shun contact with other folk, preferring the solace of the deepest forests and the companionship of wild animals. Even other elves draw their suspicion.\n***Ability Score Increase.*** Your Strength score increases by 1.\n***Grugach Weapon Training.*** You have proficiency with the spear, shortbow, longbow, and net.\n***Cantrip.*** You know one cantrip of your choice from the druid spell list. Wisdom is your spellcasting ability for it.\n***Languages.*** Unlike other elves, you don’t speak, read, or write Common. You instead speak, read, and write Sylvan."},
{"name":"Shifter Subraces","type":"Subrace","desc":"When you choose the subrace of your shifter character, you can choose one of the following options\n\" -f \"**Cliffwalk**|Your cliffwalk heritage grants you the agility of a mountain goat.\n***Ability Score Increase.*** Your Dexterity score increases by 1.\n***Shifting Feature.*** While shifting, you gain a climb speed of 30 feet.\n\" -f \"**Razorclaw**|As a razorclaw shifter, you make swift, slashing strikes in battle.\n***Ability Score Increase.*** Your Dexterity score increases by 1.\n***Shifting Feature.*** While shifting, you can make an unarmed strike as a bonus action. You can use your Dexterity for its attack roll and damage bonus, and this attack deals slashing damage."},
{"name":"College of Spirits","type":"Subclass - Bard","desc":"Stories of the past are powerful; they hold lessons of history, philosophy, and magic. Bards of the College of Spirits seek the stories of those from beyond the material plane. Using gaming sets, they reach out to hear their stories, but the bards have no control over what story they find.\n\" -f \"**Guiding Whispers**|*3rd-level College of Spirits feature*\nYou can reach out to spirits to guide you and others. You learn the guidance cantrip, which doesn’t count against the number of bard cantrips you know. For you, it has a range of 60 feet when you cast it.\n\" -f \"**Spiritual Focus**|*3rd- and 6th-level College of Spirits feature*\nYour practice of contacting spirits can employ special tools. You can use the following objects as a spellcasting focus for your bard spells: a candle, a crystal ball, a talking board, a tarokka deck, or a skull.\nAt 6th level, when you cast a bard spell that deals damage or restores hit points through the Spiritual Focus, roll a d6, and you gain a bonus to one roll of the spell equal to the number rolled.\n\" -f \"**Tales from Beyond**|*3rd-level College of Spirits feature*\nYou reach out to spirits who tell their tales through you. While you are holding your Spiritual Focus, you can use a bonus action to expend one use of your Bardic Inspiration and roll on the Spirits’ Tales table using your Bardic Inspiration die to determine the tale told. You retain the tale in mind until you bestow the tale’s effect or you finish a short or long rest.\nYou can use an action to choose one creature you can see within 30 feet of you (this can be you) to be the target of the tale’s effect. Once you do so, you can’t bestow the tale’s effect again until you roll it again.\nYou can retain only one of these tales in mind at a time, and rolling on the Spirits’ Tales table immediately ends the effect of the previous tale.\nIf the tale requires a saving throw, the DC equals your spell save DC.\n\" -f \"**Spirit Session**|*6th-level College of Spirits feature*\nYou can channel spirits to gain insights into magic. You can conduct an hour-long ritual channeling spirits (which can be done during a short or long rest) using your Spiritual Focus. You can conduct the ritual with a number of creatures equal to your proficiency bonus (including yourself). At the end of the ritual, you temporarily learn one spell of your choice from any class.\nThe spell you choose must be of a level equal to the number of creatures that conducted the ritual or less, the spell must of a level you can cast, and it must be in the school of divination or necromancy. The chosen spell counts as a bard spell for you but doesn’t count against the number of bard spells you know.\nOnce you perform the ritual, you can’t do so again until you start a long rest, and you know the chosen spell until you start a long rest.\n\" -f \"**Mystical Connection**|*14th-level College of Spirits feature*\nYour connection to spirits has become semi-permanent. Whenever you use your Tales from Beyond feature, you can roll a d6 and use it instead of expending a Bardic Inspiration die.You still use your Bardic Inspiration die for the tale’s effect, without expending it."},
{"name":"College of Satire","type":"Subclass - Bard","desc":"Bards of the College of Satire are called jesters. They use lowbrow stories, daring acrobatics, and cutting jokes to entertain audiences, ranging from the crowds in a rundown dockside pub to the nobles of a king’s royal court. Where other bards seek forgotten lore or tales of epic bravery, jesters ferret out embarrassing and hilarious stories of all kinds. Whether telling the ribald tale of a brawny stable hand’s affair with an aged duchess or a mocking satire of a paladin of Helm’s cloying innocence, a jester never lets taste, social decorum, or shame get in the way of a good laugh.\n\" -f \"**Bonus Proficiencies**|When you join the College of Satire at 3rd level, you gain proficiency with thieves’ tools. You also gain proficiency in Sleight of Hand and one additional skill of your choice. If you are already proficient with thieves’ tools or in Sleight of Hand, choose another skill proficiency for each proficiency you already have.\n\" -f \"**Tumbling Fool**|At 3rd level, you master a variety of acrobatic techniques that allow you to evade danger. As a bonus action, you can tumble. When you tumble, you gain the following benefits for the rest of your turn:\n- You gain the benefits of taking the Dash and Disengage actions.\n- You gain a climbing speed equal to your current speed.\n- You take half damage from falling.\n\" -f \"**Fool's Insight**|At 6th level, your ability to gather stories and lore gains a supernatural edge. You can cast *detect thoughts* up to a number of times equal to your Charisma modifier. You regain any expended uses of this ability after completing a long rest.\nIf a creature resists your attempt to probe deeper and succeeds at its saving throw against your *detect thoughts*, it immediately suffers an embarrassing social gaffe. It might loudly pass gas, unleash a thunderous burp, trip and fall, or be compelled to tell a tasteless joke.\n\" -f \"**Fool's Luck**|Jesters seem to have a knack for pulling themselves out of tight situations, transforming what looks like sure failure into an embarrassing but effective success. \nAt 14th level, you can expend one use of Bardic Inspiration after you fail an ability check, fail a saving throw, or miss with an attack roll. Roll a Bardic Inspiration die and add the number rolled to your attack, saving throw, or ability check, using the new result in place of the failed one. \nIf using this ability grants you a success on the attack, saving throw, or ability check, note the number you rolled on the Bardic Inspiration die. The DM can then apply that result as a penalty to an attack or check you make, and you cannot use this ability again until you suffer this drawback. When the DM invokes this penalty, describe an embarrassing gaffe or mistake you make as part of the affected die roll."},
]
