[
{"name":"Dhampir","type":"Race","desc":"Poised between the worlds of the living and the dead, dhampirs retain their grip on life yet are endlessly tested by vicious hungers. Their ties to the undead grant dhampirs a taste of a vampire’s deathless prowess in the form of increased speed, darkvision, and a life-draining bite. With unique insights into the nature of the undead, many dhampirs turn to the lives of adventurers and monster hunters. Their reasons are often deeply personal. Some seek danger, imagining monsters as personifications of their own hungers. Others pursue revenge against whatever turned them into a dhampir. And still others embrace the solitude of the hunt, striving to distance themselves from those who’d tempt their hunger.\n\" -f \"Your Dhampir gains the following traits:\n\" -f \"**Ability Score Increase.**| Your Constitution score increases by 2, and your Dexterity score increases by 1.\n\" -f \"**Size.**| Your size is Medium.\n\" -f \"**Speed.**| Your base walking speed is 35 feet.\n\" -f \"**Darkvision.**| You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light.\n\" -f \"**Languages.**| You can speak, read, and write Common and one other language of your choice.\n\" -f \"**Spider Climb.**| You have a climbing speed equal to your walking speed. In addition, at 3rd level, you can move up, down, and across vertical surfaces and upside down along ceilings, while leaving your hands free.\n\" -f \"**Vampiric Bite.**| Your fanged bite is a natural weapon, which counts as a simple melee weapon with which you are proficient. You add your Constitution modifier, instead of your strength, to the attack and damage rolls when you attack with your bite. Your bite deals 1d6 piercing damage on a hit. While you are missing half or more of your hit points, you have advantage on attack rolls you make with this bite.\nOnce per turn when you use your bite and hit a creature that isn’t a Construct or an Undead, you can regain hit points equal to 1d4 + your Constitution modifier.\nYou can regain hit points with your bite a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."},
{"name":"Hexblood","type":"Race","desc":"Where wishing fails, ancient magic can offer a heart’s desire—at least, for a time. Hexbloods are individuals infused with eldritch magic, fey energy, or mysterious witchcraft. Some who enter into bargains with hags gain their deepest wishes but eventually find themselves transformed. These changes evidence a hag’s influence: ears that split in forked points, skin in wild shades, lengthy hair that regrows if cut, and an irremovable living crown. Along with these marks, hexbloods manifest hag-like traits, such as long life, darkvision, and a variety of magical methods to beguile the senses and avoid the same.\n\" -f \"While many hexbloods gain their lineage after making a deal with a hag, others reveal their nature as they age—particularly if a hag influenced them early in life or even before their birth. Many hexbloods turn to lives of adventure, seeking to discover the mysteries of their magic, to forge a connection with their fey natures, or to avoid a hag that obsesses over them.\n\" -f \"Your Hexblood gains the following traits:\n\" -f \"**Ability Score Increase.**| Your Charisma score increases by 2, and one other ability score of your choice increases by 1. \n\" -f \"**Size.**| Your size is Medium. \n\" -f \"**Speed.**| Your base walking speed is 30 feet. \n\" -f \"**Darkvision.**| You can see in dim light within 60  feet of you as if it were bright light and in  darkness as if it were dim light. \n\" -f \"**Fey Resilience.**| You have advantage on saving  throws you make to avoid or end the charmed condition on yourself. \n\" -f \"**Hex Magic.**| You can cast the *disguise self* and  *hex* spells with this trait. Intelligence, Wisdom, or  Charisma is your spellcasting ability for these spells (you choose). Once you cast either of these spells with this trait, you  can’t cast that spell with it again until you finish a long rest. You can also cast these spells using any spells slots you have. \n\" -f \"**Magic Token.**| As an action, you can harmlessly pull out one of your nails, a tooth, or a lock of hair. This token is imbued with magic until you finish a long rest. While the token is imbued in this way, you can use an action to send a telepathic message to the creature holding or carrying the token, as long as you are on the same plane of existence and are within 10 miles of it. The message can contain up to twenty-five words.\nIn addition, while you are within 10 miles of the token, you can use an action to enter a trance for 1 minute, during which you can see and hear from the token as if you were located where it is. While you are using your senses at the token’s location, you are blinded and deafened in regard to your own surroundings. Afterward, the token is harmlessly destroyed.\nOnce you create a token using this feature, you can’t do so again until you finish a long rest, at which point your missing part regrows. \n\" -f \"**Languages.**| You can speak, read, and write Common and one other language of your choice."}
]
