[
{"name":"Theurgy","type":"Subclass - Wizard","desc":"A number of deities claim arcane magic as their domain. While the idea of a divine being embracing such power might seem contradictory, magic is as much a part of the fabric of the cosmos as wind, fire, lightning, and all other primal forces. Just as there are deities of the sea and gods of warfare, the arcane arts feature their own divine patrons.\nSuch deities often have clerics, but many gods of magic bid their followers to take up the study of wizardry. These religious magic-users follow the arcane tradition of Theurgy, and are commonly known as theurgists. Such spellcasters are as dedicated and scholarly as any other wizard, but they blend their arcane study with religious teachings.\n\" -f \"**Divine Inspiration**|When you select this tradition at 2nd level, pick a divine domain from your chosen deity’s list of eligible domains. Alternatively, the following domains are thematically appropriate and easily compatible with the theurgist concept:\n- Arcana\n- Knowledge\n- Light\n\" -f \"**Arcane Initiate**|Beginning when you select this tradition at 2nd level, whenever you gain a wizard level, you can choose to replace one of the wizard spells you add to your spellbook with a cleric domain spell for your chosen domain. The spell must be of a level for which you have spell slots.\nIf you add all of your domain spells to your spellbook, you can subsequently opt to add any spell from the cleric spell list instead. The spell must still be of a level for which you have spell slots.\nOther wizards cannot copy cleric spells from your spellbook into their own spellbooks.\n\" -f \"**Channel Arcana**|At 2nd level, you gain the ability to channel arcane energy directly from your deity, using that energy to fuel magical effects. You start with two such effects: Divine Arcana and the Channel Divinity option granted at 2nd level by your chosen domain. You employ that Channel Divinity option by using your Channel Arcana ability.\nWhen you use your Channel Arcana, you choose which effect to create. You must then finish a short or long rest to use your Channel Arcana again.\nSome Channel Arcana effects require saving throws. When you use such an effect, the save DC equals your wizard spell save DC.\nBeginning at 6th level, you can use your Channel Arcana twice between rests, and beginning at 18th level, you can use it three times between rests. When you finish a short or long rest, you regain your expended uses.\nWhen you gain further uses for Channel Divinity from your domain, you can employ them by using your Channel Arcana ability.\n\" -f \"**Channel Arcana: Divine Arcana**|As a bonus action, you speak a prayer to control the flow of magic around you. The next spell you cast gains a +2 bonus to its attack roll or saving throw DC, as appropriate.\n\" -f \"**Arcane Acolyte**|At 6th level, you gain your chosen domain’s 1st-level benefits. However, you do not gain any weapon or armor proficiencies from your domain.\n\" -f \"**Arcane Priest**|At 10th level, you gain your chosen domain’s 6th-level benefits. Your faith and your understanding of magic allow you to delve into your god’s secrets.\n\" -f \"**Arcane High Priest**|At 14th level, you gain your chosen domain’s 17th-level benefits. Your academic nature and understanding of magic and doctrine allow you to master this ability sooner than a cleric of your domain."},
{"name":"Onomancy","type":"Subclass - Wizard","desc":"Practitioners of magic well know the power of names, but wizards who follow the tradition of Onomancy use their magic to manipulate the words that encompass existence. Onomancers expand their study into language itself, searching for threads of magical significance that weave through names. Something that is named stands out in the multiverse, distinct from the tapestry of creation all around it.\nThat distinction creates power that onomancers seek to tap. By speaking a target’s true name, the wizard’s spells slip between the cracks of the target’s defenses, conforming to its essential nature through the power of its name.To protect themselves, wizards who follow this tradition often hide their true names, typically by adopting monikers and pseudonyms.\n\" -f \"**Bonus Proficiencies**|*2nd-level Onomancy feature*\nYou learn one language of your choice and gain proficiency with calligrapher’s tools.\n\" -f \"**Extract Name**|*2nd-level Onomancy feature*\nYou can magically compel a creature to divulge its true name. As a bonus action, you target one creature you can see within 60 feet of you. The target must make a Wisdom saving throw against your spell save DC. On a successful save, you discern that this magic failed, and you can’t use this feature on the target again. On a failed save, the target is charmed by you until the end of your next turn, and you mentally learn the charmed target’s name or the fact that the target lacks a name.\nYou can use this feature a number of times equal to your Intelligence modifier (minimum of once), and you regain all expended uses of it when you finish a long rest.\n\" -f \"**Fateful Naming**|*2nd-level Onomancy feature*\nYou can bend magic to assist or hinder creatures through the power of their true names, and even use those names as an anchor to affect others around them. The bane and bless spells are wizard spells for you, and you add them to your spellbook. You always have them prepared, yet they don’t count against the number of spells you can prepare.\nYou can cast either spell without expending a spell slot if you speak the true name of one target of the spell as part of casting it. You can cast the spells in this way a number of times equal to your Intelligence modifier (a minimum of once), and you regain all expended uses when you finish a long rest.\n\" -f \"**Resonant Utterance**|*6th-level Onomancy feature*\nYou learn words of power called Resonants, which allow you to tailor your spells through the use of a target’s true name.\n***Resonants Known.*** When you gain this feature, you learn two Resonants of your choice, which are detailed in the “Resonant Options” section. Each time you gain a level in this class, you can replace one resonant you know with a different one.\n***Using a Resonant.*** You can use one Resonant when you cast a wizard spell with a spell slot and speak the true name of one creature targeted by the spell. Speaking the name is part of casting the spell.\nYou can use Resonants a number of times equal to half of your wizard level (round down), and you regain all expended uses when you finish a long rest.\n***Resonant Options.*** Here are your options when choosing a Resonant:\n\" -f \"- **Absorption.** When you cast a spell that deals damage to the named target, you gain 3d6 temporary hit points. The number of temporary hit points you gain increases by 1d6 when you reach 10th level (4d6) and 14th level (5d6) in this class.\n- **Devastation.** If the spell requires the named creature to make a saving throw, that creature has disadvantage on the first save it makes against the spell.\n- **Dissolution.** The first time the named creature takes damage from the spell, that creature takes an extra 2d8 force damage. The extra force damage increases by 1d8 when you reach 10th level (3d8) and 14th level (4d8) in this class.\n\" -f \"- **Nullification.** If the named target is affected by any other spells, you know what those spells are, and you can attempt to end one of your choice by succeeding on an Intelligence check with a DC equal to 10 + the level of the chosen spell.\n- **Puppetry.** The first time the named creature takes damage from the spell, you can knock the creature prone or move it up to 10 feet, either directly toward you or away from you.\n- **Sympathy.** If the named creature is within range of the spell, you can target the creature with the spell even if you can’t see the creature or it has total cover against the spell.\n\" -f \"**Inexorable Pronouncement**|*10th-level Onomancy feature*\nYou learn two new Resonants of your choice from your Resonant Utterance feature.\n\" -f \"**Relentless Naming**|*14th-level Onomancy feature*\nYou have learned how to bypass a named creature’s defenses against certain types of damage. When you cast a spell that deals damage to a creature whose true name you speak as part of casting the spell, you can cause the spell to deal force or psychic damage to the creature, instead of the spell’s normal damage type."},
{"name":"School of Invention","type":"Subclass - Wizard","desc":"The School of Invention claims credit for inventing the other schools of magic—a claim other wizards find absurd. Wizards of this school push magic to its limits. They stretch the known laws of arcane power and strive to reveal important truths about the nature of the multiverse.\nAdherents of this school believe that innovation is best served through experimentation. They have a reputation for acting first, thinking second. Most wizards are scholars who have mastered their craft through careful study, rigorous practice, and endless hours of repetition. These wizards would rather throw spells together and see what happens.\nMany wizards of this tradition are gnomes, alchemists, or both, and they take pride in the magic-infused armor they don. The armor not only provides protection, but it is also designed to help the wizard channel magic in unpredictable ways.\nWizards of this tradition are regarded as savants to their faces, but wizards of other traditions often think of them as lunatics.\n\" -f \"**Tools of the Inventor**|At 2nd level, you gain proficiency with two tools of your choice.\n\" -f \"**Arcanomechanical Armor**|Innovation is a dangerous practice, at least as far as members of this school practice it. As a shield against this risk, you have developed a suit of arcane armor.\nStarting at 2nd level, you gain proficiency with light armor and gain a suit of arcanomechanical armor—a magic item that only you can attune to. While you are attuned to it and wearing it, it grants you resistance to force damage.\nThe armor is light armor and provides an AC of 12 + your Dexterity modifier. It weighs 8 pounds.\nYou can create a new suit of it at the end of a long rest by touching a nonmagical suit of studded leather armor, which magically transforms it. Doing so removes the magic from your previous arcanomechanical armor, turning it into nonmagical studded leather.\n\" -f \"**Reckless Casting**|Starting at 2nd level, you can attempt to cast a spell you don’t have prepared. When you use this ability, you use your action and choose one of the following options:\n- Roll on the Reckless Casting table for cantrips and cast the resulting spell as part of this action.\n- Expend a spell slot and roll twice on the Reckless Casting table for its level, or the 5th-level table if the slot is 6th level or higher. Pick which of the two results you want to use and cast the resulting spell as part of this action.\nIf the spell you cast isn’t a wizard spell, it is nonetheless a wizard spell for you when you cast it with this feature.\n\" -f \"**Alchemical Casting**|At 6th level, you learn to channel magic through your arcanomechanical armor to augment spells in a variety of ways. When you cast a spell while wearing that armor and attuned to it, you can expend one additional spell slot of 1st or 2nd level to alter the spell. The effect depends on the spell slot you expend.\nA 1st-level slot allows you to manipulate the spell’s energy. When you cast a spell that deals acid, cold, fire, lightning, or thunder damage, you can substitute that damage type for another one from that list.\nA 2nd-level slot increases the spell’s raw force. If you roll damage for the spell when you cast it, increase that damage by 2d10 force damage against one of the spell’s targets (your choice) this turn.\n\" -f \"**Prodigious Inspiration**|At 10th level, you have attained a greater mastery of spell preparation. As a bonus action, you can replace one spell you have prepared with another spell from your spellbook. You can’t use this ability again until you finish a short or long rest.\n\" -f \"**Controlled Chaos**|At 14th level, your ability to improvise magic grows stronger. Whenever you roll on a Reckless Casting table for a spell other than a cantrip, you can roll on the table that is one level higher than the expended spell slot."},
{"name":"Reckless Casting table","type":"Table - School of Invention","desc":"```d10 | Cantrip\n----|----------------\n1   | acid splash\n2   | chill touch\n3   | fire bolt\n4   | light\n5   | poison spray\n6   | ray of frost\n7   | shocking grasp\n8   | sacred flame\n9   | thorn whip\n10  | Roll twice and cast each cantrip, but if you roll another 10 on either die, you cast nothing, wasting your action.```\n\" -f \"1st Level|```d10 | 1st-Level Spell\n----|---------------\n1   | burning hands\n2   | chromatic orb\n3   | color spray\n4   | faerie fire\n5   | false life\n6   | fog cloud\n7   | jump\n8   | magic missile\n9   | thunderwave\n10  | Roll twice and cast each spell, but if you roll another 10 on either die, you cast nothing, wasting your action but not the spell slot.```\n\" -f \"2nd Level|```d10 | 2nd-Level Spell\n----|-------------------\n1   | blur\n2   | darkness\n3   | enlarge/reduce\n4   | gust of wind\n5   | invisibility\n6   | levitate\n7   | Melf’s acid arrow\n8   | scorching ray\n9   | shatter\n10  | Roll twice and cast each spell, but if you roll another 10 on either die, you cast nothing, wasting your action but not the spell slot.```\n\" -f \"3rd Level|```d10 | 3rd-Level Spell\n----|----------------\n1   | blink\n2   | fear\n3   | feign death\n4   | fireball\n5   | fly\n6   | gaseous form\n7   | lightning bolt\n8   | sleet storm\n9   | stinking cloud\n10  | Roll twice and cast each spell, but if you roll another 10 on either die, you cast nothing, wasting your action but not the spell slot.```\n\" -f \"4th Level|```d10 | 4th-Level Spell\n----|-------------------------\n1   | blight\n2   | confusion\n3   | Evard’s black tentacles\n4   | fire shield\n5   | greater invisibility\n6   | ice storm\n7   | phantasmal killer\n8   | stoneskin\n9   | wall of fire\n10  | Roll twice and cast each spell, but if you roll another 10 on either die, you cast nothing, wasting your action but not the spell slot.```\n\" -f \"5th Level|```d10 | 5th-Level Spell\n----|------------------\n1   | cloudkill\n2   | cone of cold\n3   | destructive wave\n4   | flame strike\n5   | hold monster\n6   | insect plague\n7   | mass cure wounds\n8   | wall of force\n9   | wall of stone\n10  | Roll twice and cast each spell, but if you roll another 10 on either die, you cast nothing, wasting your action but not the spell slot.```"},
{"name":"Rune Scribe","type":"Prestige Class","desc":"Consult the [Allowed UA Document](https://bit.ly/3u73Iu7) on how to use Prestige Classes.\n\" -f \"**The Rune Scribe**|```Level | Features                      | 1st | 2nd | 3rd\n1st   | Rune Lore, Runic Magic        | 2   | —   | —\n2nd   | Runic Discovery               | 3   | —   | —\n3rd   | Runic Discovery               | 4   | 2   | —\n4th   | Living Rune                   | 4   | 3   | —\n5th   | Rune Mastery, Runic Discovery | 4   | 3   | 2```\n\" -f \"**Prerequisites**|In order to advance as a rune scribe, you must meet the following prerequisites (in addition to the multiclassing prerequisites for your existing class):\n- **Dexterity 13**. Rune scribes need agile fingers to master the intricate patterns of a rune.\n- **Intelligence 13**. Rune lore requires intense study and knowledge.\n- **Proficiency in the Arcana skill**. Rune mastery requires an understanding of arcane lore.\n- **Character level 5th**. Rune magic awakens only for powerful souls, and you must be a 5th-level character before you can gain levels in the rune scribe prestige class.\n- **Complete a special task**. You must find a rune and present it to an NPC rune scribe who accepts it in return for tutoring you in the ways of rune magic. You cannot gain more levels in this prestige class than your tutor has. You might need to seek out additional runes and present them to more skilled rune scribes in order to reach 5th level in this prestige class.\n\" -f \"**Hit Points**|**Hit Dice:** 1d8 per rune scribe level\n**Hit Points per Level:** 1d8 (or 5) + your Constitution modifier per rune scribe level\n\" -f \"**Proficiencies**|**Tools:** Calligrapher’s supplies, mason’s tools, woodcarver’s tools\n**Saving Throws:** None\n**Skills:** None\n\" -f \"**Rune Lore**|At 1st level, you learn the basics of scribing runes, and are able to activate a master rune’s full range of properties when you are properly attuned to it. The “Rune Magic” section below contains information on master runes and descriptions of runes and their properties.\nThe first rune you master is the rune you found and presented to your tutor to qualify for this prestige class. Your entrance to the class includes the process of mastering that rune’s secrets.\n\" -f \"**Runic Magic**|Runes can make use of your own magical power to augment some of their effects. You gain a number of spell slots as specified on the Rune Scribe table, but this prestige class does not grant spells known.\nInstead, as a rune scribe, you can expend your spell slots to empower runes, as described in the “Rune Magic” section (available through this command).\nFor the purpose of multiclassing, to determine your total spell slots, add your levels in rune scribe to your levels in classes that grant you the Spellcasting feature. For example, if you are a rune scribe 4/wizard 6, you would have the spell slots of a 10th-level character, in addition to having the cantrips and spellbook of a 6th-level wizard.\n\" -f \"**Runic Discovery**|Your continuing study of runic magic allows you to recreate the secrets of new runes without first needing to uncover them. At 2nd, 3rd, and 5th level, choose a rare rune. You can attune to that rune even if you do not possess the master rune for it. (See the “Rune Magic” section below for information on rune rarity and master runes.) In order to attune to a rune in this manner, you must spend a short rest doing nothing but meditating on the rune. At the end of the short rest, you are attuned to the rune. You are considered to always have the rune on your person for the purpose of determining whether you can use its features.\nYou can spend another short rest doing nothing but meditating on the rune to end your attunement to it.\n\" -f \"**Living Rune**|Runes are a part of the living world, and your studies allow you to connect to their magic in increasingly powerful ways. At 4th level, you learn to incorporate rune magic into your identity, allowing you to augment your body and mind.\nAt the end of a long rest, you can choose to increase one ability score of your choice by 2 or increase two ability scores of your choice by 1. At the end of each subsequent long rest, you can alter this choice, reducing the scores you previously increased and improving different scores. (If you chose to increase two abilities, you can opt to alter only one of those choices.)\n\" -f \"**Rune Mastery**|At 5th level, you attain the ability to master an ever-greater range of runic magic. When you attune to a rune, you can choose to have it not count toward your limit of attuned magic items.\nYou can be attuned to only one such rune in this manner at a time. You can use this ability again after you end your attunement to a rune."},
{"name":"Rune Magic","type":"Other","desc":"Rune magic allows a character to unlock the power contained within magical symbols and sigils. Not every such mark has the potential for power. Only those runes forged in the ancient days of creation still resonate with the fundamental magic of the world.\nRunes work much like magic items. You can discover them, attune to them, and use their magic in a variety of ways. However, unlike with magic items, only a rune scribe can use all the benefits a rune offers.\n\" -f \"**Overview**|Runes are powerful icons that you can use for a variety of effects. In order to use a rune, you must normally find and keep a **master rune**. A master rune is a rare object—a gem or carved rock, a magical token, a shard of some special material, and so on—engraved with the rune and empowered with magic that allows you to unleash the rune’s effects. Those effects are divided into two categories.\n**Simple properties** are usable by anyone who attunes to a master rune.\n**Complex properties** are usable only by a character who attunes to a master rune and who possesses the Rune Lore class feature.\nUnless otherwise noted, you must have a master rune on your person in order to use its properties.\n\" -f \"**Finding Runes**|A rune found as treasure is a master rune, carefully scribed into a rare object and available for use as a training tool to allow would-be rune scribes to unlock its power. Each rune discussed below is detailed as part of a master rune.\nMaster runes and the runes they contain are treated much like magic items. They are categorized in rarity from rare to legendary, and can be placed in a campaign whenever the DM opts to place treasure. There are no common or uncommon runes.\n\" -f \"**Buying and Selling Runes**|Treat a master rune as a magic item of its equivalent rarity for the purpose of buying and selling in the campaign. Just as with other magic items, the DM will determine whether such items are available to purchase in the campaign and under what conditions.\n\" -f \"**Identifying Runes**|Runes are identified in a manner similar to magic items. Simply handling a master rune causes a strong sense of its rune’s identity to echo in a character’s mind. For example, touching a master rune item containing the *kalt* rune (the rune of cold) might cause you to experience a sudden chill as visions of snow and ice flash through your mind.\nThe *identify* spell immediately reveals a master rune’s simple properties. You can also learn its simple properties over the course of a short rest while maintaining physical contact with the rune.\n\" -f \"**Runes and Attunement**|A rune always requires attunement to use its simple properties. Attuning to a master rune requires you to spend a short rest focused on only that item while being in physical contact with it. This can’t be the same short rest used to learn the rune’s properties. This focus takes the form of carefully and repeatedly copying the rune, whether with ink and parchment or simply scribing it into the dirt. If the short rest is interrupted, the attunement attempt fails. Otherwise, at the end of the short rest, you gain an intuitive understanding of how to activate the rune’s magical properties.\nA master rune can be attuned to only one creature at a time, and all runes count toward your limit of magic items you can attune to. Any attempt to attune to a fourth magic item or rune fails (though a rune scribe’s Rune Mastery feature allows attunement to one additional rune). You cannot attune to more than one copy of a rune.\nYou can end attunement to a rune in the same manner as with any other magic item."},
{"name":"Arcane Weapon","type":"Spell","desc":"*1st-level transmutation. (Artificer, Bard, Ranger, Wizard)*\n\" -f \"**Meta**|- **Casting Time:** 1 bonus action\n- **Range:** Self\n- **Components:** V, S\n- **Duration:** Concentration, up to 1 hour\n\" -f \"**Description**|You channel arcane energy into one simple or martial weapon you’re holding, and choose one damage type: acid, cold, fire, lightning, poison, or thunder. Until the spell ends, you deal an extra 1d6 damage of the chosen type to any target you hit with the weapon. If the weapon isn’t magical, it becomes a magic weapon for the spell’s duration.\n\nAs a bonus action, you can change the damage type, choosing from the options above.\n\" -f \"***At Higher Levels.***|When you cast this spell using a spell slot of 3rd level or higher, you can maintain your concentration on the spell for up to 8 hours."},
{"name":"Commune with City","type":"Spell","desc":"*5th-level divination (Artificer, Bard, Sorcerer, Warlock, Wizard)*\n\" -f \"**Meta**|- **Casting Time:** 1 minute (ritual)\n- **Range:** Self\n- **Components:** V, S\n- **Duration:** Instantaneous\n\" -f \"**Description**|You briefly become one with the city and gain knowledge of the surrounding area. Aboveground, this spell gives you knowledge of the area within 1 mile of you. In sewers and other underground settings, you gain knowledge of the area within 600 feet of you.\n\nYou instantly gain knowledge of up to three facts of your choice about any of the following subjects as they relate to the area:\n\n- Terrain and bodies of water\n- Prevalent buildings, plants, animals, or intelligent creatures\n- Powerful (CR 1 or higher celestials, fey, fiends, elementals, or undead\n- Influences from other planes of existence\n- Electrical currents, wireless signals, and active transit lines and tracks\n\nFor example, you could determine the location of powerful undead in the area, the location of major sources of electrical power or interference, and the location of any nearby parks."},
{"name":"Draconic Transformation","type":"Spell","desc":"*7th-level transmutation (Druid, Sorcerer, Wizard)*\n\" -f \"**Meta**|- **Casting Time:** 1 bonus action\n- **Range:** Self\n- **Components:** V, S, M (a statuette of a dragon, worth at least 500 gp)\n- **Duration:** Concentration, up to 1 minute\n\" -f \"**Description**|With a roar, you draw on the magic of dragons to transform yourself, taking on various draconic features. You gain the following benefits until the spell ends:\n\n- You have blindsight with a range of 30 feet. Within that range, you can effectively see anything that isn’t behind total cover, even if you’re blinded or in darkness. Moreover, you can see an invisible creature, unless the creature successfully hides from you.\n- Incorporeal wings sprout from your back, giving you a flying speed of 40 feet.\n- When you cast this spell, and as a bonus action on subsequent turns for the duration, you can exhale a breath of shimmering energy in a 30-foot cone. Each creature in the area must make a Dexterity saving throw, taking 3d8 force damage on a failed save or half as much damage on a successful one."},
{"name":"Fizban's Platinum Shield","type":"Spell","desc":"*6th-level abjuration (Sorcerer, Wizard)*\n\" -f \"**Meta**|- **Casting Time:** 1 action\n- **Range:** 60 feet\n- **Components:** V, S, M (a platinum-plated dragon scale, worth at least 500 gp)\n- **Duration:** Concentration, up to 1 minute\n\" -f \"**Description**|You create a field of silvery light that surrounds a creature of your choice within range (you can choose yourself). The field sheds dim light out to 5 feet. As a bonus action on subsequent turns, you can move the field to another creature within 60 feet of the field. The creature protected by the field gains the following benefits:\n\n- The creature has half cover.\n- The creature has resistance to acid, cold, fire, lightning, and poison damage.\n- If the creature is subjected to an effect that allows it to make a Dexterity saving throw to take only half damage, the creature instead takes no damage if it succeeds on the saving throw, and only half damage if it fails."},
{"name":"Flame Stride","type":"Spell","desc":"*3rd-level transmutation (Artificer, Ranger, Sorcerer, Wizard)*\n\" -f \"**Meta**|- **Casting Time:** 1 bonus action\n- **Range:** Self\n- **Components:** V, S\n- **Duration:** Concentration, up to 1 minute\n\" -f \"**Description**|The billowing flames of a dragon cover your feet, granting you explosive speed. For the duration, your speed increases by 20 feet and moving doesn’t provoke opportunity attacks.\n\nWhen you move within 5 feet of a creature or object that isn’t being worn or carried, it takes 1d6 fire damage from your trail of heat. A creature or object can take this damage only once during a turn.\n\" -f \"***At Higher Levels.***|When you cast this spell using a spell slot of 4th level or higher, increase your speed by 5 feet for each spell slot level above 3rd. Additionally, the spell deals an additional 1d6 fire damage for each slot level above 3rd."},
{"name":"Guiding Hand","type":"Spell","desc":"*1st-level divination (Artificer, Bard, Cleric, Druid, Warlock)*\n\" -f \"**Meta**|- **Casting Time:** 1 minute (ritual)\n- **Range:** 5 feet\n- **Components:** V, S\n- **Duration:** Concentration, up to 8 hours\n\" -f \"**Description**|You create a Tiny incorporeal hand of shimmering light in an unoccupied space you can see within range. The hand exists for the duration, but it disappears if you teleport or you travel to a different plane of existence.\n\nWhen the hand appears, you name one major landmark, such as a city, mountain, castle, or battlefield on the same plane of existence as you. Someone in history must have visited the site and mapped it. If the landmark appears on no map in existence, the spell fails. Otherwise, whenever you move toward the hand, it moves away from you at the same speed you moved, and it moves in the direction of the landmark, always remaining 5 feet away from you.\n\nIf you don’t move toward the hand, it remains in place until you do and beckons for you to follow once every 1d4 minutes."},
{"name":"Healing Elixir","type":"Spell","desc":"*1st-level conjuration (Artificer, Cleric, Warlock, Wizard)*\n\" -f \"**Meta**|- **Casting Time:** 1 minute\n- **Range:** Self\n- **Components:** V, S, M (alchemist’s supplies)\n- **Duration:** 24 hours\n\" -f \"**Description**|You create a healing elixir in a simple vial that appears in your hand. The elixir retains its potency for the duration or until it’s consumed, at which point the vial vanishes.\n\nAs an action, a creature can drink the elixir or administer it to another creature. The drinker regains 2d4 + 2 hit points."},
{"name":"Icingdeath's Frost","type":"Spell","desc":"*2nd-level evocation (Sorcerer, Wizard)*\n\" -f \"**Meta**|- **Casting Time:** 1 action\n- **Range:** Self (15-foot cone)\n- **Components:** S, M (a vial of meltwater)\n- **Duration:** Instantaneous\n\" -f \"**Description**|A burst of icy cold energy emanates from you in a 30-foot cone. Each creature in that area must make a Constitution saving throw. On a failed save, a creature takes 3d8 cold damage and is covered in ice for 1 minute or until a creature uses its action to break the ice off itself or another creature. A creature covered in ice has its speed reduced to 0. On a successful save, a creature takes half as much damage with no additional effects.\n\" -f \"***At Higher Levels.***|When you cast this spell using a spell slot of 3rd level or higher, increase the cold damage by 1d8 for each slot level above 2nd."},
{"name":"Intellect Fortress","type":"Spell","desc":"*5th-level abjuration (Bard, Sorcerer, Warlock, Wizard)*\n\" -f \"**Meta**|- **Casting Time:** 1 action\n- **Range:** Self\n- **Components:** V, S\n- **Duration:** Concentration, up to 10 minutes\n\" -f \"**Description**|You create a faintly shimmering barrier of protective psychic power around you. For the duration, you have advantage on all saving throws.\n\nWhen another creature that you can see within 30 feet of you fails a saving throw, you can use your reaction to allow them to reroll the save. They must use the new roll."},
{"name":"Mental Barrier","type":"Spell","desc":"*2nd-level abjuration (Bard, Sorcerer, Warlock, Wizard)*\n\" -f \"**Meta**|- **Casting Time:** 1 reaction, which you take when you are forced to make an Intelligence, a Wisdom, or a Charisma saving throw\n- **Range:** Self\n- **Components:** V\n- **Duration:** 1 round\n\" -f \"**Description**|You protect your mind with a wall of looping, repetitive thought. Until the start of your next turn, you have advantage on Intelligence, Wisdom, and Charisma saving throws, and you have resistance to psychic damage."},
{"name":"Mind Sliver","type":"Spell","desc":"*Enchantment cantrip (Bard, Sorcerer, Warlock, Wizard)*\n\" -f \"**Meta**|- **Casting Time:** 1 action\n- **Range:** 60 feet\n- **Components:** V\n- **Duration:** 1 round\n\" -f \"**Description**|You drive a disorienting spike of psychic energy into the mind of one creature you can see within range. The target must make an Intelligence saving throw. Unless the saving throw is successful, the target takes 1d6 psychic damage, and the first time it makes a saving throw before the end of your next turn, it must roll a d4 and subtract the number rolled from the save.\n\nThis spell’s damage increases by 1d6 when you reach certain levels: 5th level (2d6), 11th level (3d6), and 17th level (4d6)."},
{"name":"Mind Thrust","type":"Spell","desc":"*2nd-level enchantment (Bard, Sorcerer, Warlock, Wizard)*\n\" -f \"**Meta**|- **Casting Time:** 1 action\n- **Range:** 60 feet\n- **Components:** V, S\n- **Duration:** 1 round\n\" -f \"**Description**|You propel a lance of psionic disruption into the mind of one creature you can see within range. The target must make an Intelligence saving throw. On a failed save, the target takes 3d6 psychic damage, and it can use its action only to Dash or Disengage on its next turn. On a successful save, the target takes half as much damage, and this spell doesn’t limit its action options.\n\" -f \"***At Higher Levels.***| When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd. The creatures must be within 30 feet of each other when you target them."},
{"name":"Nathair's Mischief","type":"Spell","desc":"*2nd-level illusion (Bard, Sorcerer, Wizard)*\n\" -f \"**Meta**|- **Casting Time:** 1 action\n- **Range:** 60 feet\n- **Components:** S, M (a piece of crust from an apple pie)\n- **Duration:** Concentration, up to 1 minute\n\" -f \"**Description**|You fill a 20-foot cube centered on a point you choose within range with fey and draconic magic. Roll on the Mischievous Surge table to determine the magical effect produced. At the start of each of your turns, you can move the cube up to 10 feet and reroll on the table.\n\" -f \"**Mischievous Surge**|```d4 | Effect\n---|--------------\n1  | The smell of apple pie fills the air, and each creature in the cube must succeed on a Wisdom saving throw or become charmed by you until the start of your next turn.\n2  | Bouquets of flowers appear all around, and each creature in the cube must succeed on a Dexterity saving throw or be blinded until the start of your next turn as the flowers spray water in their faces.\n3  | Each creature in the cube must succeed on a Wisdom saving throw or begin giggling until the start of your next turn. A giggling creature is incapacitated and uses all its movement to move in a random direction.\n4  | Drops of molasses appear and hover in the cube, turning it into difficult terrain until the start of your next turn.```"},
{"name":"On/Off","type":"Spell","desc":"*Transmutation cantrip (Artificer, Sorcerer, Warlock, Wizard)*\n\" -f \"**Meta**|- **Casting Time:** 1 action\n- **Range:** 60 feet\n- **Components:** V, S\n- **Duration:** Instantaneous\n\" -f \"**Description**|This cantrip allows you to activate or deactivate any electronic device within range, as long as the device has a clearly defined on or off function that can be easily accessed from the outside of the device. Any device that requires a software based shutdown sequence to activate or deactivate cannot be affected by on/off."},
{"name":"Protection from Ballistics","type":"Spell","desc":"*3rd-level abjuration (Artificer, Sorcerer, Warlock, Wizard)*\n\" -f \"**Meta**|- **Casting Time:** 1 action\n- **Range:** Touch\n- **Components:** V, S, M (a shell casing)\n- **Duration:** Concentration, up to 10 minutes\n\" -f \"**Description**This spell enchants the flesh of the target against the impact of bullets. Until the spell ends, the target has resistance to Bludgeoning, Piercing, and Slashing damage from firearms."},
{"name":"Psionic Blast","type":"Spell","desc":"*3rd-level evocation (Bard, Sorcerer, Warlock, Wizard)*\n\" -f \"**Meta**|- **Casting Time:** 1 action\n- **Range:** Self (30-foot cone)\n- **Components:** V\n- **Duration:** Instantaneous\n\" -f \"**Description**|You unleash a destructive wave of mental power in a 30-foot cone. Each creature in the area must make a Dexterity saving throw. On a failed save, a target takes 5d8 force damage, is pushed 20 feet directly away from you, and is knocked prone. On a successful save, a target takes half as much damage and isn’t pushed or knocked prone.\n\" -f \"***At Higher Levels.***| When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d8 for each slot level above 3rd."},
{"name":"Puppet","type":"Spell","desc":"*1st-level enchantment (Bard, Warlock, Wizard)*\n\" -f \"**Meta**|- **Casting Time:** 1 action\n- **Range:** 120 feet\n- **Components:** S\n- **Duration:** Instantaneous\n\" -f \"**Description**|Your gesture forces one humanoid you can see within range to make a Constitution saving throw. On a failed save, the target must move up to its speed in a direction you choose. In addition, you can cause the target to drop whatever it is holding. This spell has no effect on a humanoid that is immune to being charmed."},
{"name":"Raulothim's Psychic Lance","type":"Spell","desc":"*4th-level enchantment (Bard, Sorcerer, Warlock, Wizard)*\n\" -f \"**Meta**|- **Casting Time:** 1 action\n- **Range:** 120 feet\n- **Components:** V\n- **Duration:** Instantaneous\n\" -f \"**Description**|You unleash a shimmering lance of psychic power from your forehead at a creature that you can see within range. Alternatively, you can utter the creature’s name. If the named target is within range, it gains no benefit from cover or invisibility as the lance homes in on it. If the named target isn’t within range, the lance dissipates, and the spell slot is not expended.\n\nThe target must succeed on an Intelligence saving throw or take 10d6 psychic damage and be incapacitated until the start of your next turn.\n\" -f \"***At Higher Levels.***| When you cast this spell using a spell slot of 5th level or higher, the damage increases by 1d6 for each slot level above 4th."},
{"name":"Sense Emotion","type":"Spell","desc":"*1st-level divination (Bard, Warlock, Wizard)*\n\" -f \"**Meta**|- **Casting Time:** 1 action\n- **Range:** Self\n- **Components:** V, S\n- **Duration:** Concentration, up to 10 minutes\n\" -f \"**Description**|You attune your senses to pick up the emotions of others for the duration. When you cast the spell, and as your action on each turn until the spell ends, you can focus your senses on one humanoid you can see within 30 feet of you. You instantly learn the target’s prevailing emotion, whether it’s love, anger, pain, fear, calm, or something else. If the target isn’t actually humanoid or it is immune to being charmed, you sense that it is calm."},
{"name":"Sudden Awakening","type":"Spell","desc":"*1st-level enchantment (Bard, Ranger, Sorcerer, Wizard)*\n\" -f \"**Meta**|- **Casting Time:** 1 bonus action\n- **Range:** 10 feet\n- **Components:** V\n- **Duration:** Instantaneous\n\" -f \"**Description**|Each sleeping creature you choose within range awakens, and then each prone creature within range can stand up without expending any movement."},
{"name":"Summon Draconic Spirit","type":"Spell","desc":"*5th-level conjuration (Druid, Sorcerer, Wizard)*\n\" -f \"**Meta**|- **Casting Time:** 1 action\n- **Range:** 60 feet\n- **Components:** V, S, M (an art object from a dragon’s hoard, worth at least 500 gp)\n- **Duration:** Concentration, up to 1 hour\n\" -f \"**Description**|You call forth a draconic spirit. It manifests in an unoccupied space that you can see within range.This corporeal form uses the Draconic Spirit stat block (available through this command). When you cast this spell, choose a family of dragon: Chromatic, Gem, or Metallic. The creature resembles a dragon of the chosen family, which determines certain traits in its stat block. The creature disappears when it drops to 0 hit points or when the spell ends.\n\nThe creature is an ally to you and your companions. In combat, the creature shares your initiative count, but it takes its turn immediately after yours. It obeys your verbal commands (no action required by you). If you don’t issue any, it takes the Dodge action and uses its move to avoid danger.\n\" -f \"**At Higher Levels.***|When you cast this spell using a spell slot of 6th level or higher, use the higher level wherever the spell’s level appears in the stat block."},
{"name":"Draconic Spirit","type":"Creature - Summon Draconic Spirit","desc":"Large dragon\n**AC:** 14 + the level of the spell (natural armor)\n**HP:** 50 + 10 for each spell level above 5th\n**Speed:** 30 ft., fly 80 ft., swim 30 ft.\n**STR**: 19 (+4) **DEX**: 14 (+2) **CON**: 17 (+3)\n**INT**: 10 (+0) **WIS**: 14 (+2) **CHA**: 14 (+2)\n**Damage Resistances (Chromatic and Metallic only)** acid, cold, fire, lightning, poison\n**Damage Resistances (Gem only)** force, necrotic, psychic, radiant, thunder\n**Condition Immunities** charmed, frightened, poisoned\n**Senses** blindsight 30 ft., darkvision 60 ft., passive Perception 12\n**Languages** Draconic, understands the languages you speak\n**Challenge — Proficiency Bonus** equals your bonus\n\" -f \"**Special Abilities**|***Shared Resistances.*** When you summon the dragon, choose one of its damage resistances. You have resistance to the chosen damage type until the spell ends.\n\" -f \"**Actions**|***Multiattack.*** The dragon uses its Breath Weapon, and it makes a number of Bite and Claw attacks equal to half the spell’s level (rounded down).\n***Bite and Claw.*** *Melee Weapon Attack:* your spell attack modifier to hit, reach 10 ft., one target.*Hit:* 1d6 + 4 + the spell’s level piercing damage.\n***Breath Weapon.*** The dragon exhales a stream of multicolored energy in a 30-foot cone. Each creature inthat area must make a Dexterity saving throw, taking 2d6 damage of your choice of a damage type this dragon has resistance to on a failed save, or half as much damage on a successful one"},
{"name":"Synchronicity","type":"Spell","desc":"*4th-level enchantment (Artificer, Sorcerer, Warlock, Wizard)*\n\" -f \"**Meta**|- **Casting Time:** 1 action\n- **Range:** Touch\n- **Components:** V, S\n- **Duration:** Concentration, up to 1 hour\n\" -f \"**Description**|The creature you touch feels reality subtly shifted to its favor while this spell is in effect. The target isn’t inconvenienced by mundane delays of any sort. Traffic lights are always green, there’s always a waiting elevator, and a taxi is always around the corner. The target can run at full speed through dense crowds, and attacks of opportunity provoked by the target’s movement are made with disadvantage.\n\nSynchronicity grants advantage to Dexterity (Stealth) checks, since the target always finds a handy piece of cover available. Additionally, the target has advantage on all ability checks made to drive a vehicle.\n\nIn the event that two or more creatures under the effect of synchronicity are attempting to avoid being inconvenienced by each other, the creatures engage in a contest of Charisma each time the effects of the spells would oppose each other."},
{"name":"Thought Shield","type":"Spell","desc":"*2nd-level abjuration (Bard, Sorcerer, Warlock, Wizard)*\n\" -f \"**Meta**|- **Casting Time:** 1 action\n- **Range:** Touch\n- **Components:** V, S\n- **Duration:** 8 hours\n\" -f \"**Description**|You weave a clouding veil over the mind of one creature you touch. For the duration, the target’s mind can’t be read or detected, creatures can’t telepathically communicate with the target unless the target allows it, and the target has advantage on saving throws against any effect that would determine whether it is telling the truth."},
{"name":"Unearthly Chorus","type":"Spell","desc":"*1st-level illusion (Artificer, Bard)*\n\" -f \"**Meta**|- **Casting Time:** 1 action\n- **Range:** Self (30-foot radius)\n- **Components:** V\n- **Duration:** Concentration, up to 10 minutes\n\" -f \"**Description**|Music of a style you choose fills the air around you in a 30-foot radius. The music spreads around corners and can be heard from up to 100 feet away. The music moves with you, centered on you for the duration.\n\nUntil the spell ends, you make Charisma (Performance) checks with advantage. In addition, you can use a bonus action on each of your turns to beguile one creature you choose within 30 feet of you that can see you and hear the music. The creature must make a Charisma saving throw. If you or your companions are attacking it, the creature automatically succeeds on the saving throw. On a failure, the creature becomes friendly to you for as long as it can hear the music and for 1 hour thereafter. You make Charisma (Deception) checks and Charisma (Persuasion) checks against creatures made friendly by this spell with advantage."},
{"name":"Virtue","type":"Spell","desc":"*Abjuration cantrip (Cleric, Warlock)*\n\" -f \"**Meta**|- **Casting Time:** 1 action\n- **Range:** Touch\n- **Components:** V, S\n- **Duration:** 1 round\n\" -f \"**Description**|You touch one creature, imbuing it with vitality. If the target has at least 1 hit point, it gains a number of temporary hit points equal to 1d4 + your spellcasting ability modifier. The temporary hit points are lost when the spell ends."},
{"name":"Wild Cunning","type":"Spell","desc":"*1st-level transmutation (Druid, Ranger)*\n\" -f \"**Meta**|- **Casting Time:** 1 action (ritual)\n- **Range:** 120 feet\n- **Components:** V, S\n- **Duration:** Instantaneous\n\" -f \"**Description**|You call out to the spirits of nature to aid you. When you cast this spell, choose one of the following effects:\n\n- If there are any tracks on the ground within range, you know where they are, and you make Wisdom (Survival) checks to follow these tracks with advantage for 1 hour or until you cast this spell again.\n- If there is edible forage within range, you know it and where to find it.\n- If there is clean drinking water within range, you know it and where to find it.\n- If there is suitable shelter for you and your companions with range, you know it and where to find.\n- Send the spirits to bring back wood for a fire and to set up a campsite in the area using your supplies. The spirits build the fire in a circle of stones, put up tents, unroll bedrolls, and put out any rations and water for consumption.\n- Have the spirits instantly break down a campsite, which includes putting out a fire, taking down tents, packing up bags, and burying any rubbish."},
{"name":"Alchemist","type":"Feat","desc":"You have studied the secrets of alchemy and are an expert in its practice, gaining the following benefits:\n\n- Increase your Intelligence score by 1, to a maximum of 20.\n- You gain proficiency with alchemist’s supplies. If you are already proficient with them, you add double your proficiency bonus to checks you make with them.\n- As an action, you can identify one potion within 5 feet of you, as if you had tasted it. You must see the liquid for this benefit to work.\n- Over the course of any short rest, you can temporarily improve the potency of one *potion of healing* of any rarity. To use this benefit, you must have alchemist’s supplies with you, and the potion must be within reach. If the potion is drunk no more than 1 hour after the short rest ends, the creature drinking the potion can forgo the potion’s die roll and regains the maximum number of hit points that the potion can restore."},
{"name":"Blade Mastery","type":"Feat","desc":"You master the shortsword, longsword, scimitar, rapier, and greatsword. You gain the following benefits when using any of them:\n\n- You gain a +1 bonus to attack rolls you make with the weapon.\n- On your turn, you can use your reaction to assume a parrying stance, provided you have the weapon in hand. Doing so grants you a +1 bonus to your AC until the start of your next turn or until you’re not holding the weapon.\n- When you make an opportunity attack with the weapon, you have advantage on the attack roll."},
{"name":"Burglar","type":"Feat","desc":"You pride yourself on your quickness and your close study of certain clandestine activities. You gain the following benefits:\n\n- Increase your Dexterity score by 1, to a maximum of 20.\n- You gain proficiency with thieves’ tools. If you are already proficient with them, you add double your proficiency bonus to checks you make with them."},
{"name":"Dragonmark","type":"Feat","desc":"You have a magical mark that indicates you are a member of one of the dragonmarked houses. Select one of the options from the Dragonmarks table.\n\nYou gain the ability to innately cast spells and cantrips, as summarized in the Dragonmark Benefits table, using the spellcasting ability listed under the Ability column. You cast each spell at its lowest level. Once you cast a given spell this way, you must finish a long rest before you can cast it innately again. You must still expend any material components. Your dragonmark confers the following benefits:\n\n- When you first take this feat, you gain the **least dragonmark**. You learn the spells listed under the Least column.\n- At 5th level and higher, your mark becomes more potent, improving to **lesser dragonmark**. You also learn the spell listed under the Lesser column.\n- At 9th level and higher, your mark’s power increases again, becoming a **greater dragonmark**. You also learn the spell listed under the Greater column.\n\" -f \"Table|```Mark        | Ability | Least | Lesser | Greater\nDetection   | WIS     | Detect magic, mage hand | Detect thoughts | Clairvoyance\nFinding     | WIS     | Identify, mage hand | Locate object | Clairvoyance\nHandling    | WIS     | Druidcraft, speak with animals | Beast sense | Conjure animals\nHealing     | WIS     | Cure wounds, spare the dying | Lesser restoration | Revivify\nHospitality | CHA     | Friends, unseen servant | Rope trick | Leomund’s tiny hut\nMaking      | INT     | Identify, mending | Magic weapon | Fabricate\nPassage     | INT     | Expeditious retreat, light | Misty step | Teleportation circle\nScribing    | INT     | Comprehend languages, message | Sending | Tongues\nSentinel    | WIS     | Blade ward, compelled duel | Blur | Protection from energy\nShadow      | CHA     | Dancing lights, disguise self | Darkness | Nondetection\nStorm       | INT     | Fog cloud, shocking grasp | Gust of wind | Sleet storm\nWarding     | INT     | Alarm, resistance | Arcane lock | Magic circle```"},
{"name":"Fell Handed","type":"Feat","desc":"You master the handaxe, battleaxe, greataxe, warhammer, and maul. You gain the following benefits when using any of them:\n\n- You gain a +1 bonus to attack rolls you make with the weapon.\n- Whenever you have advantage on a melee attack roll you make with the weapon and hit, you can knock the target prone if the lower of the two d20 rolls would also hit the target.\n- Whenever you have disadvantage on a melee attack roll you make with the weapon, the target takes bludgeoning damage equal to your Strength modifier (minimum of 0) if the attack misses but the higher of the two d20 rolls would have hit.\n- If you use the Help action to aid an ally’s melee attack while you’re wielding the weapon, you knock the target’s shield aside momentarily. In addition to the ally gaining advantage on the attack roll, the ally gains a +2 bonus to the roll if the target is using a shield."},
{"name":"Flail Mastery","type":"Feat","desc":"The flail is a tricky weapon to use, but you have spent countless hours mastering it. You gain the following benefits.\n\n- You gain a +1 bonus to attack rolls you make with a flail.\n- As a bonus action on your turn, you can prepare yourself to extend your flail to sweep over targets’ shields. Until the end of this turn, your attack rolls with a flail gain a +2 bonus against any target using a shield.\n- When you hit with an opportunity attack using a flail, the target must succeed on a Strength saving throw (DC 8 + your proficiency bonus + your Strength modifier) or be knocked prone."},
{"name":"Gift of the Chromatic Dragon","type":"Feat","desc":"You’ve manifested some of the power of chromatic dragons, granting you the following benefits:\n\n- As a bonus action, you can touch a simple or martial weapon and infuse it with one of the following damage types: acid, cold, fire, lightning, or poison. For the next minute, the weapon deals an extra 1d4 damage of the chosen type when it hits. After you use this ability, you can’t do so again until you finish a long rest.\n- When you take acid, cold, fire, lightning, or poison damage, you can use your reaction to give yourself resistance to that instance of damage. You can use this reaction a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."},
{"name":"Gift of the Metallic Dragon","type":"Feat","desc":"You’ve manifested some of the power of metallic dragons, granting you the following benefits:\n\n- You learn the cure wounds spell. You can cast this spell without expending a spell slot. Once you cast this spell in this way, you can’t do so again until you finish a long rest. You can also cast this spell using spell slots you have. The spell’s spellcasting ability is Intelligence, Wisdom, or Charisma when you cast it with this feat (choose when you gain the feat).\n- You can manifest protective wings that can shield you or others from attacks. When you or another creature you can see within 5 feet of you is hit by an attack roll, you can use your reaction to manifest spectral wings from your back for a moment. Roll a d4 and grant a bonus to the target’s AC equal to the number rolled against that attack roll, potentially causing it to miss. You can use this reaction a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."},
{"name":"Gift of the Gem Dragon","type":"Feat","desc":"You’ve manifested some of the power of gem dragons, granting you the following benefits:\n\n- Increase your Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20.\n- When you take damage from a creature that is within 10 feet of you, you can use your reaction to emanate telekinetic energy. The creature that dealt damage to you must succeed on a Strength saving throw (DC equals 8 + your proficiency bonus + the ability modifier of the score increased by this feat) or take 2d8 force damage and be pushed 10 feet away from you. You can use this reaction a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."},
{"name":"Gourmand","type":"Feat","desc":"You have mastered a variety of special recipes, allowing you to prepare exotic dishes with useful effects. You gain the following benefits:\n\n- Increase your Constitution score by 1, to a maximum of 20.\n- You gain proficiency with cook’s utensils. If you are already proficient with them, you add double your proficiency bonus to checks you make with them.\n- As an action, you can inspect a drink or plate of food within 5 feet of you and determine whether it is poisoned, provided that you can see and smell it.\n- During a long rest, you can prepare and serve a meal that helps you and your allies recover from the rigors of adventuring, provided you have suitable food, cook’s utensils, and other supplies on hand. The meal serves up to six people, and each person who eats it regains two additional Hit Dice at the end of the long rest. In addition, those who partake of the meal have advantage on Constitution saving throws against disease for the next 24 hours."},
{"name":"Master of Disguise","type":"Feat","desc":"You have honed your ability to shape your personality and to read the personalities of others. You gain the following benefits:\n\n- Increase your Charisma score by 1, to a maximum of 20.\n- You gain proficiency with the disguise kit. If you are already proficient with it, you add double your proficiency bonus to checks you make with it.\n- If you spend 1 hour observing a creature, you can then spend 8 hours crafting a disguise you can quickly don to mimic that creature. Making the disguise requires a disguise kit. You must make checks as normal to disguise yourself, but you can assume the disguise as an action."},
{"name":"Practiced Expert","type":"Feat","desc":"You have honed your proficiency with particular skills or tools, gaining the following benefits:\n\n- Increase one ability score of your choice by 1, to a maximum of 20.\n- You gain proficiency with one skill or tool of your choice.\n- Choose one of your skill or tool proficiencies. Your proficiency bonus is doubled for any ability check you make that uses the chosen proficiency."},
{"name":"Shield Training","type":"Feat","desc":"You’ve trained in the effective use of shields. You gain the following benefits:\n\n- Increase your Strength, Dexterity, or Constitution score by 1, to a maximum of 20.\n- You gain proficiency with shields.\n- In combat, you can don or doff a shield as the free object interaction on your turn.\n- If you have the Spellcasting or Pact Magic feature, you can use a shield as a spellcasting focus."},
{"name":"Spear Mastery","type":"Feat","desc":"Though the spear is a simple weapon to learn, it rewards you for the time you have taken to master it. You gain the following benefits:\n\n- You gain a +1 bonus to attack rolls you make with a spear.\n- When you use a spear, its damage die changes from a d6 to a d8, and from a d8 to a d10 when wielded with two hands. (This benefit has no effect if another feature has already improved the weapon’s die.)\n- You can set your spear to receive a charge. As a bonus action, choose a creature you can see that is at least 20 feet away from you. If that creatures moves within your spear’s reach on its next turn, you can make a melee attack against it with your spear as a reaction. If the attack hits, the target takes an extra 1d8 piercing damage, or an extra 1d10 piercing damage if you wield the spear with two hands. You can’t use this ability if the creature used the Disengage action before moving.\n- As a bonus action on your turn, you can increase your reach with a spear by 5 feet for the rest of your turn."},
{"name":"Tandem Tactician","type":"Feat","desc":"Your presence in a scrap tends to elevate your comrades. You gain the following benefits:\n\n- You can use the Help action as a bonus action.\n- When you use the Help action to aid an ally in attacking a creature, increase the range of the Help action by 10 feet. Additionally, you can help two allies targeting the same creature within range when you use the Help action this way."},
{"name":"Tracker","type":"Feat","desc":"You have spent time hunting creatures and honed your skills, gaining the following benefits:\n\n - Increase your Wisdom score by 1, to a maximum of 20.\n - You learn the *hunter’s mark* spell. You can cast it once without expending a spell slot, and you must finish a long rest before you can cast it in this way again. You can also cast the spell using any spell slots you have. Wisdom is your spellcasting ability for this spell.\n - You have advantage on Wisdom (Survival) checks to track creatures"},
{"name":"Acrobat","type":"Feat","desc":"You become more nimble, gaining the following benefits:\n\n- Increase your Dexterity score by 1, to a maximum of 20.\n- You gain proficiency in the Acrobatics skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n- As a bonus action, you can make a DC 15 Dexterity (Acrobatics) check. If you succeed, difficult terrain doesn’t cost you extra movement until the end of the current turn."},
{"name":"Animal Handler","type":"Feat","desc":"You master the techniques needed to train and handle animals. You gain the following benefits.\n\n- Increase your Wisdom score by 1, to a maximum of 20.\n- You gain proficiency in the Animal Handling skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n- You can use a bonus action on your turn to command one friendly beast within 60 feet of you that can hear you and that isn’t currently following the command of someone else. You decide now what action the beast will take and where it will move during its next turn, or you issue a general command that lasts for 1 minute, such as to guard a particular area."},
{"name":"Arcanist","type":"Feat","desc":"You study the arcane arts, gaining the following benefits:\n\n- Increase your Intelligence score by 1, to a maximum of 20.\n- You gain proficiency in the Arcana skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n- You learn the *prestidigitation* and *detect magic* spells. You can cast *detect magic* once without expending a spell slot, and you regain the ability to do so when you finish a long rest."},
{"name":"Brawny","type":"Feat","desc":"You become stronger, gaining the following benefits:\n\n- Increase your Strength score by 1, to a maximum of 20.\n- You gain proficiency in the Athletics skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n- You count as if you were one size larger for the purpose of determining your carrying capacity."},
{"name":"Diplomat","type":"Feat","desc":"You master the arts of diplomacy, gaining the following benefits:\n\n- Increase your Charisma score by 1, to a maximum of 20.\n- You gain proficiency in the Persuasion skill. If you are already proficient in this skill, you add double your proficiency bonus to checks you make with it.\n- If you spend 1 minute talking to someone who can understand what you say, you can make a Charisma (Persuasion) check contested by the creature’s Wisdom (Insight) check. If you or your companions are fighting the creature, your check automatically fails. If your check succeeds, the target is charmed by you as long as it remains within 60 feet of you and for 1 minute thereafter."},
{"name":"Empathic","type":"Feat","desc":"You possess keen insight into how other people think and feel. You gain the following benefits:\n\n- Increase your Wisdom score by 1, to a maximum of 20.\n- You gain proficiency in the Insight skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n- You can use your action to try to get uncanny insight about one humanoid you can see within 30 feet of you. Make a Wisdom (Insight) check contested by the target’s Charisma (Deception) check. If your check succeeds, you have advantage on attack rolls and ability checks against the target until the end of your next turn."},
{"name":"Historian","type":"Feat","desc":"Your study of history rewards you with the following benefits:\n\n- Increase your Intelligence score by 1, to a maximum of 20.\n- You gain proficiency in the History skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n- When you take the Help action to aid another creature’s ability check, you can make a DC 15 Intelligence (History) check. On a success, that creature’s check gains a bonus equal to your proficiency bonus, as you share pertinent advice and historical examples. To receive this bonus, the creature must be able to understand what you’re saying."},
{"name":"Investigator","type":"Feat","desc":"You have an eye for detail and can pick out the smallest clues. You gain the following benefits:\n\n- Increase your Intelligence score by 1, to a maximum of 20.\n- You gain proficiency in the Investigation skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n- You can take the Search action as a bonus action."},
{"name":"Medic","type":"Feat","desc":"You master the physician’s arts, gaining the following benefits:\n\n- Increase your Wisdom score by 1, to a maximum of 20.\n- You gain proficiency in the Medicine skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n- During a short rest, you can clean and bind the wounds of up to six willing beasts and humanoids. Make a DC 15 Wisdom (Medicine) check for each creature. On a success, if a creature spends a Hit Die during this rest, that creature can forgo the roll and instead regain the maximum number of hit points the die can restore. A creature can do so only once per rest, regardless of how many Hit Dice it spends."},
{"name":"Menacing","type":"Feat","desc":"You become fearsome to others, gaining the following benefits:\n\n- Increase your Charisma score by 1, to a maximum of 20.\n- You gain proficiency in the Intimidation skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n- When you take the Attack action on your turn, you can replace one attack with an attempt to demoralize one humanoid you can see within 30 feet of you that can see and hear you. Make a Charisma (Intimidation) check contested by the target’s Wisdom (Insight) check. If your check succeeds, the target is frightened until the end of your next turn. If your check fails, the target can’t be frightened by you in this way for 1 hour."},
{"name":"Naturalist","type":"Feat","desc":"Your extensive study of nature rewards you with the following benefits:\n\n- Increase your Intelligence score by 1, to a maximum of 20.\n- You gain proficiency in the Nature skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n- You learn the *druidcraft* and *detect poison and disease* spells. You can cast *detect poison and disease* once without expending a spell slot, and you regain the ability to do so when you finish a long rest."},
{"name":"Perceptive","type":"Feat","desc":"You hone your senses until they become razor sharp. You gain the following benefits:\n\n- Increase your Wisdom score by 1, to a maximum of 20.\n- You gain proficiency in the Perception skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n- Being in a lightly obscured area doesn’t impose disadvantage on your Wisdom (Perception) checks if you can both see and hear."},
{"name":"Performer","type":"Feat","desc":"You master performance so that you can command any stage. You gain the following benefits:\n\n- Increase your Charisma score by 1, to a maximum of 20.\n- You gain proficiency in the Performance skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n- While performing, you can try to distract one humanoid you can see who can see and hear you. Make a Charisma (Performance) check contested by the humanoid’s Wisdom (Insight) check. If your check succeeds, you grab the humanoid’s attention enough that it makes Wisdom (Perception) and Intelligence (Investigation) checks with disadvantage until you stop performing."},
{"name":"Quick-Fingered","type":"Feat","desc":"Your nimble fingers and agility let you perform sleight of hand. You gain the following benefits:\n\n- Increase your Dexterity score by 1, to a maximum of 20.\n- You gain proficiency in the Sleight of Hand skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n- As a bonus action, you can make a Dexterity (Sleight of Hand) check to plant something on someone else, conceal an object on a creature, lift a purse, or take something from a pocket."},
{"name":"Silver-Tongued","type":"Feat","desc":"You develop your conversational skill to better deceive others. You gain the following benefits:\n\n- Increase your Charisma score by 1, to a maximum of 20.\n- You gain proficiency in the Deception skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n- When you take the Attack action on your turn, you can replace one attack with an attempt to deceive one humanoid you can see within 30 feet of you that can see and hear you. Make a Charisma (Deception) check contested by the target’s Wisdom (Insight) check. If your check succeeds, your movement doesn’t provoke opportunity attacks from the target and your attack rolls against it have advantage; both benefits last until the end of your next turn or until you use this ability on a different target. If your check fails, the target can’t be deceived by you in this way for 1 hour."},
{"name":"Stealthy","type":"Feat","desc":"You know how best to hide. You gain the following benefits:\n\n- Increase your Dexterity score by 1, to a maximum of 20.\n- You gain proficiency in the Stealth skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n- If you are hidden, you can move up to 10 feet in the open without revealing yourself if you end the move in a position where you’re not clearly visible."},
{"name":"Survivalist","type":"Feat","desc":"You master wilderness lore, gaining the following benefits:\n\n- Increase your Wisdom score by 1, to a maximum of 20.\n- You gain proficiency in the Survival skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n- You learn the *alarm* spell. You can cast it once without expending a spell slot, and you regain the ability to do so when you finish a long rest."},
{"name":"Theologian","type":"Feat","desc":"Your extensive study of religion rewards you with the following benefits:\n\n- Increase your Intelligence score by 1, to a maximum of 20.\n- You gain proficiency in the Religion skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.\n- You learn the *thaumaturgy* and *detect evil and good* spells. You can cast *detect evil and good* once without expending a spell slot, and you regain the ability to do so when you finish a long rest"},
{"name":"Barbed Hide","type":"Feat","desc":"*Prerequisite: Tiefling*\n\" -f \"**Description**|One of your ancestors was a barbed devil or other spiky fiend. Barbs protrude from your head. You gain the following benefits:\n\n- Increase your Constitution or Charisma score by 1, up to a maximum of 20.\n- As a bonus action, you can cause small barbs to protrude all over your body or cause them to retract. At the start of each of your turns while the barbs are out, you deal 1d6 piercing damage to any creature grappling you or any creature grappled by you.\n- You gain proficiency in the Intimidation skill. If you’re already proficient in it, your proficiency bonus is doubled for any check you make with it."},
{"name":"Critter Friend","type":"Feat","desc":"*Prerequisite: Gnome (forest)*\n\" -f \"**Description**|Your friendship with animals mystically deepens. You gain the following benefits:\n\n- You gain proficiency in the Animal Handling skill. If you’re already proficient in it, your proficiency bonus is doubled for any check you make with it.\n- You learn the *speak with animals* spell and can cast it at will, without expending a spell slot. You also learn the *animal friendship* spell, and you can cast it once with this feat, without expending a spell slot. You regain the ability to cast it in this way when you finish a long rest. Intelligence is your spellcasting ability for these spells."},
{"name":"Dragon Wings","type":"Feat","desc":"*Prerequisite: Dragonborn*\n\" -f \"**Description**|You sprout draconic wings. With your wings, you have a flying speed of 20 feet if you aren’t wearing heavy armor and aren’t exceeding your carrying capacity."},
{"name":"Dwarf Resilience","type":"Feat","desc":"*Prerequisite: Dwarf*\n\" -f \"**Description**|You have the blood of dwarf heroes flowing through your veins. You gain the following benefits:\n\n- Increase your Constitution score by 1, to a maximum of 20.\n- Whenever you take the Dodge action in combat, you can spend one Hit Die to heal yourself. Roll the die, add your Constitution modifier, and regain a number of hit points equal to the total (minimum of 1)."},
{"name":"Everybody's Friend","type":"Feat","desc":"*Prerequisite: Half-elf*\n\" -f \"**Description**|You develop your magnetic personality to ease your way through the world. You gain the following benefits:\n\n- Increase your Charisma score by 1, up to a maximum of 20.\n- You gain proficiency in the Deception and Persuasion skills. If you’re already proficient in either skill, your proficiency bonus is doubled for any check you make with that skill."},
{"name":"Wonder Maker","type":"Feat","desc":"*Prerequisite: Gnome (rock)*\n\" -f \"**Description**|You master the tinker techniques of your people. You gain the following benefits:\n\n- Increase your Dexterity or Intelligence score by 1, to a maximum of 20.\n- When you make a check using your proficiency with tinker’s tools, you add double your proficiency bonus to the check.\n\" -f \"- When you make a device with your Tinker trait, you have the following additional options for what you make:\n\n- *Alarm.* This device senses when a creature moves to within 15 feet of it without speaking aloud a password chosen when you create it. One round after a creature moves into range, the alarm makes a shrill ringing that lasts for 1 minute and can be heard from up to 300 feet away.\n- *Calculator.* This device makes doing sums easy.\n- *Lifter.* This device can be used as a block and tackle, allowing its user to hoist five times the weight the user can normally lift.\n- *Timekeeper.* This pocket watch keeps accurate time.\n- *Weather Sensor.* When used as an action, this device predicts weather conditions in a 1-mile radius over the next 4 hours, showing one symbol (clouds, sun/moon, rain, or snow) for each hour."},
{"name":"Grudge-Bearer","type":"Feat","desc":"*Prerequisite: Dwarf*\n\" -f \"**Description**|You have a deep hatred for a particular kind of creature. Choose your foes, a type of creature to bear the burden of your wrath: aberrations, beasts, celestials, constructs, dragons, elementals, fey, fiends, giants, monstrosities, oozes, plants, or undead. Alternatively, you can choose two races of humanoid (such as gnolls and orcs). You gain the following benefits:\n\n- Increase your Strength, Constitution, or Wisdom score by 1, to a maximum of 20.\n- During the first round of any combat against your chosen foes, your attack rolls against any of them have advantage.\n- When any of your chosen foes makes an opportunity attack against you, it makes the attack roll with disadvantage.\n- Whenever you make an Intelligence (Arcana, History, Nature, or Religion) check to recall information about your chosen foes, you add double your proficiency bonus to the check, even if you’re not normally proficient."},
{"name":"Human Determination","type":"Feat","desc":"*Prerequisite: Human*\n\" -f \"**Description**|You are filled with a determination that can draw the unreachable within your reach. You gain the following benefits:\n\n- Increase one ability score of your choice by 1, to a maximum of 20.\n- When you make an attack roll, an ability check, or a saving throw, you can do so with advantage. Once you use this ability, you can’t use it again until you finish a short or long rest."},
{"name":"Orcish Aggression","type":"Feat","desc":"*Prerequisite: Half-orc*\n\" -f \"**Description**|As a bonus action, you can move up to your speed toward an enemy of your choice that you can see or hear. You must end this move closer to the enemy than you started."},
{"name":"Mariner","type":"Fighting Style","desc":"As long as you are not wearing heavy armor or using a shield, you have a swimming speed and a climbing speed equal to your normal speed, and you gain a +1 bonus to AC."},
{"name":"Close Quarters Shooter","type":"Fighting Style","desc":"You are trained in making ranged attacks at close quarters. When making a ranged attack while you are within 5 feet of a hostile creature, you do not have disadvantage on the attack roll. Your ranged attacks ignore half cover and three-quarters cover against targets within 30 feet of you. Finally, you have a +1 bonus to attack rolls on ranged attacks."},
{"name":"Tunnel Fighter","type":"Fighting Style","desc":"You excel at defending narrow passages, doorways, and other tight spaces. As a bonus action, you can enter a defensive stance that lasts until the start of your next turn. While in your defensive stance, you can make opportunity attacks without using your reaction, and you can use your reaction to make a melee attack against a creature that moves more than 5 feet while within your reach."},
{"name":"Silver Tongue","type":"Maneuver Option","desc":"When you make a Charisma (Deception) check or a Charisma (Persuasion) check, you can expend one superiority die, and add the superiority die to the ability check."},
{"name":"Snipe","type":"Maneuver Option","desc":"As a bonus action, you can expend one superiority die and make a ranged weapon attack. You can draw a thrown weapon as part of making this attack. If you hit, add the superiority die to the attack’s damage roll."},
{"name":"Studious Eye","type":"Maneuver Option","desc":"When you make a Wisdom (Insight) check or an Intelligence (Investigation) check, you can expend one superiority die, and add the superiority die to the ability check."},
{"name":"Arcane Gunslinger","type":"Eldritch Invocation","desc":"*Prerequisite: Pact of the Blade feature*\n\nYou can create a pact weapon that is a firearm, and you can transform a magical firearm into your pact weapon."},
{"name":"Burning Hex","type":"Eldritch Invocation","desc":"*Prerequisite: Hex spell or a warlock feature that curses*\n\nAs a bonus action, you cause a target cursed by your Hex to take fire damage equal to your Charisma modifier (minimum of 1)."},
{"name":"Caiphon's Beacon","type":"Eldritch Invocation","desc":"*Prerequisite: The Great Old One patron*\n\nThe purple star Caiphon is the doom of inexperienced mariners. Those who use its deceptive light to guide their travels invariably come to ruin. You gain proficiency in the Deception and Stealth skills, and you have advantage on attack rolls against charmed creatures."},
{"name":"Chilling Hex","type":"Eldritch Invocation","desc":"*Prerequisite: Hex spell or a warlock feature that curses*\n\nAs a bonus action, you cause frost to swirl around a target cursed by your Hex, dealing cold damage to each of your enemies within 5 feet of the target. The cold damage equals your Charisma modifier (minimum of 1)."},
{"name":"Chronicle of the Raven Queen","type":"Eldritch Invocation","desc":"*Prerequisite: Raven Queen patron, Pact of the Tome feature*\n\nYou can place a corpse’s hand or similar appendage on your Book of Shadows and ask one question aloud. After 1 minute, the answer appears written in blood in your book. The answer is provided by the dead creature’s spirit to the best of its knowledge and is translated into a language of your choice. You must use this ability within 1 minute of a creature’s death, and a given creature can only be asked one question in this manner."},
{"name":"Eldritch Armor","type":"Eldritch Invocation","desc":"*Prerequisite: Pact of the Blade feature*\n\nAs an action, you can touch a suit of armor that isn’t being worn or carried by anyone and instantly don it, provided you aren’t wearing armor already. You are proficient with this suit of armor until it’s removed."},
{"name":"Green Lord's Gift","type":"Eldritch Invocation","desc":"*Prerequisite: The Archfey patron*\n\nThe Green Lord oversees a verdant realm of everlasting summer. Your soul is linked to his power. Whenever you regain hit points, you treat any dice rolled to determine the hit points you regain as having rolled their maximum value."},
{"name":"Kiss of Mephistopheles","type":"Eldritch Invocation","desc":"*Prerequisite: 5th level, the Fiend patron, eldritch blast cantrip*\n\nYou can channel the fires of Mephistopheles through your *eldritch blast*. When you hit a creature with that cantrip, you can cast *fireball* as a bonus action using a warlock spell slot. However, the spell must be centered on a creature you hit with *eldritch blast*."},
{"name":"Path of the Seeker","type":"Eldritch Invocation","desc":"*Prerequisite: The Seeker patron*\n\nThe Seeker bids you to travel in search of knowledge, and little can prevent you from waling this path. You ignore difficult terrain, have advantage on all checks to escape a grapple, manacles, or rope bindings, and advantage on saving throws against being paralyzed."},
{"name":"Raven Queen's Blessing","type":"Eldritch Invocation","desc":"*Prerequisite: Raven Queen patron, eldritch blast cantrip*\n\nWhen you score a critical hit with your *eldritch blast* cantrip, pick yourself or an ally you can see within 30 feet of you. The chosen creature can immediately expend a Hit Die to regain hit points equal to the roll + the creature’s Constitution modifier (minimum of 1 hit point)."},
{"name":"Seeker's Speech","type":"Eldritch Invocation","desc":"*Prerequisite: The Seeker patron*\n\nYour quest for knowledge allows you to master any spoken language. When you complete a long rest, you can pick two languages. You gain the ability to speak, read, and write the chosen languages until you finish your next long rest."},
{"name":"Superior Pact Weapon","type":"Eldritch Invocation","desc":"*Prerequisite: 9th level, Pact of the Blade feature*\n\nAny weapon you create using your Pact of the Blade feature is a *+2 weapon*. This invocation doesn’t affect a magic weapon you transformed into your pact weapon."},
{"name":"Ultimate Pact Weapon","type":"Eldritch Invocation","desc":"*Prerequisite: 15th level, Pact of the Blade feature*\n\nAny weapon you create using your Pact of the Blade feature is a *+3 weapon*. This invocation doesn’t affect a magic weapon you transformed into your pact weapon."},
{"name":"Distant Eye","type":"Ki Feature","desc":"When you make a ranged weapon attack, you can spend 1 ki point to prevent attacking at long range from imposing disadvantage on your attack rolls until the end of the current turn."},
{"name":"Empowering Reserves","type":"Font of Magic Option","desc":"When you make an ability check on your turn, you can spend 2 sorcery points to gain advantage on the check."},
{"name":"Imbuing Touch","type":"Font of Magic Option","desc":"As an action, you can touch one nonmagical weapon and spend 2 sorcery points to imbue it with magic for 1 minute. For the duration, the weapon is considered magical for the purpose of overcoming immunity and resistance to nonmagical attacks."},
{"name":"Sorcerous Fortitude","type":"Font of Magic Option","desc":"As an action, you can spend any number of sorcery points to roll a d4 for each point expended. You gain a number of temporary hit points equal to the total rolled."},
{"name":"Unerring Spell","type":"Metamagic","desc":"If you make an attack roll for a spell and miss, you can spend 2 sorcery points to reroll the attack roll. You must use the result of the second roll."},
{"name":"Many-Handed Pouch","type":"Artificer Infusion","desc":"*Prerequisite: 4th-level artificer*\n*Item: 2–5 pouches*\n\nThe infused pouches all share one interdimensional space of the same capacity as a single pouch. Thus, reaching into any of the pouches allows access to the same storage space. A pouch operates as long as it is within 100 miles of another one of the pouches; the pouch is otherwise empty and won’t accept any contents.\n\nIf this infusion ends, the items stored in the shared space move into one of the pouches, determined at random. The rest of the pouches become empty."},
{"name":"Hacking Tools","type":"Tool","desc":"This kit contains the hardware and software necessary to allow access into most computer systems and electronic devices. Proficiency with hacking tools lets you add your proficiency bonus to any Intelligence checks you make to connect to or make use of a computer system or electronic device. The kit fits snugly in a backpack or toolbox."},
{"name":"Opal of the Ild Rune","type":"Item - Master Rune","desc":"*Master rune, rare (requires attunement)*\n\" -f \"**Description**|This triangular fire opal measures about three inches on each side and is half an inch thick. The *ild* rune—the rune of fire—shimmers within its core. Grasping this object causes a split second of searing, fiery pain to pass through you. That pain quickly fades, giving way to a warming glow.\n\" -f \"***Ignite (Simple Property).***|As an action, you scribe the *ild* rune using ash onto a flammable object. That object immediately bursts into flame. While it burns, the fire extends 1 foot out from the rune you scribed.\n\" -f \"***Fire Tamer (Simple Property).***|As an action, you touch an open flame and scribe the *ild* rune within it with a hand motion. This causes the flame to immediately extinguish. For a large blaze, the fire is extinguished in a 10-foot radius around you. You can extend this distance by expending a spell slot when using the *ild* rune in this manner. The radius extends by 20 feet per level of the expended spell slot.\n\" -f \"***Fire’s Friend (Simple Property).***|While you are attuned to this rune, you have resistance to cold damage.\n\" -f \"***Combustion (Complex Property).***|As an action, you scribe this rune using ash onto a creature within your reach as you expend a spell slot. The creature automatically takes 1d10 fire damage plus 1d10 fire damage per level of the expended spell slot.\n\" -f \"***Flame Brand (Complex Property).***|Over the course of a short rest, you inscribe this rune using ash onto a melee or ranged weapon, or onto up to 20 pieces of ammunition. The weapon or ammunition gains a ghostly aura of yellow flame and deals fire damage instead of piercing, slashing, or bludgeoning damage.\n\nIn addition, you can expend a spell slot while using this property to grant the weapon or ammunition a bonus to attack rolls and damage rolls equal to the spell slot’s level divided by three.\n\nThese effects last for 24 hours or until you use this property again.\n\" -f \"***Flame Stoker (Complex Property).***|While you are attuned to this rune, your fire attacks are deadlier. Whenever you roll fire damage from an attack or a spell you cast, you can reroll that damage and use the higher result."},
{"name":"Orb of the Stein Rune","type":"Item - Master Rune","desc":"*Master rune, rare (requires attunement)*\n\" -f \"**Description**|This spherical chunk of granite is about the size of a human fist. The *stein* rune—the rune of stone— appears on the orb as crystalline veins that play across its surface. When first grasped, the stone feels impossibly heavy, as if even a titan could not lift it. That feeling passes after a moment, allowing you to carry the stone with ease.\n\" -f \"***Indomitable Stand (Simple Property).***|As an action, you scribe the *stein rune* onto the ground at your feet. Until you move, you have advantage on all ability checks and saving throws to resist effects that would force you to move. In addition, any creature that moves within 10 feet of you must succeed on a DC 12 Strength saving throw or have its movement immediately end.\n\" -f \"***Stone Soul (Simple Property).***|While you are attuned to this rune, you cannot be petrified.\n\" -f \"***Stone’s Secrets (Simple Property).***|As an action, you scribe this rune onto a stone wall or floor. You learn the location and size of all creatures standing on or touching that surface within 30 feet of you, though only for the moment when the property is used.\n\" -f \"***Crushing Brand (Complex Property).***|Over the course of a short rest, you inscribe this rune using dirt or crushed stone onto one weapon that deals bludgeoning damage. The weapon gains a ghostly brown aura, and bludgeoning damage dealt by the weapon ignores resistance and immunity. If you roll the maximum on the weapon’s damage die or dice, the target of your attack is knocked prone if it is a creature.\n\nIn addition, you can expend a spell slot to grant the weapon a bonus to attack rolls and damage rolls equal to the spell slot’s level divided by three.\n\nThese effects last for 24 hours or until you use this property again.\n\" -f \"***Earthen Step (Complex Property).***|While you are attuned to this rune, you can cast *meld into stone* as a bonus action. You regain this ability after a short or long rest.\n\" -f \"***Overwhelming Bolt (Complex Property).***|As an action, you scribe this rune using dirt or crushed rock onto a creature within your reach as you expend a spell slot. The creature must succeed on a Strength saving throw (DC 12 + the level of the expended spell slot). On a failure, the creature takes 2d8 bludgeoning damage plus 1d8 bludgeoning damage per level of the expended spell slot and is knocked prone. On a successful saving throw, the creature takes half as much damage and is not knocked prone."},
{"name":"Pennant of the Vind Rune","type":"Item - Master Rune","desc":"*Master rune, rare (requires attunement)*\n\" -f \"**Description**|This five-foot-long blue pennant is crafted from silk and whips about as if buffeted by a strong breeze. The *vind* rune—the rune of wind—flickers across its surface like a shimmering cloud. Grasping the pennant causes you to feel a powerful gust of wind wash over you, tearing at your clothes and gear. Anyone watching you sees nothing out of the ordinary, and the sensation passes after a moment.\n\" -f \"***Comforting Wind (Simple Property).***|While you are attuned to this rune, you cannot suffocate or drown, and you gain advantage on saving throws against poisonous gases, inhaled poisons, and similar effects.\n\" -f \"***Wind Step (Simple Property).***|As an action, you scribe the *vind* rune in the air around you and immediately fly 20 feet. If you do not land at the end of this flight, you fall.\n\" -f \"***Wind’s Grasp (Simple Property).***|As a reaction when you fall, you can scribe this rune in the air around you to take no damage from the fall.\n\" -f \"***Howling Brand (Complex Property).***|Over the course of a short rest, you inscribe this rune in theair above one ranged weapon. The weapon gains a ghostly blue aura and has its normal and maximum range doubled. The weapon’s attacks do not suffer disadvantage due to range.\n\nIn addition, you can expend a spell slot while using this property to grant the weapon a bonus to attack rolls and damage rolls equal to the spell slot’s level divided by three.\n\nThese effects last for 24 hours or until you use this property again.\n\" -f \"***Shrieking Bolt (Complex Property).***|As an action, you scribe this rune in the air between you and a creature you can see while you expend a spell slot. The creature must make a Strength saving throw (DC 12 + the spell slot’s level). On a failure, it takes 2d8 bludgeoning damage plus 1d8 bludgeoning damage per level of the expended spell slot, and is pushed in a straight line directly away from you for 10 feet per level of the expended spell slot. On a successful saving throw, the creature takes half as much damage and is not pushed away from you.\n\" -f \"***Wind Walker (Complex Property).***|While you are attuned to this rune, you can cast *levitate* as a bonus action. You regain this ability after a short or long rest."},
{"name":"Shard of the Kalt Rune","type":"Item - Master Rune","desc":"*Master rune, rare (requires attunement)*\n\" -f \"**Description**|This long, slender shard of ice is roughly the size of a dagger. The *kalt* rune—the rune of ice—glows within the shard. When first grasped, the shard emits a painful cold that leaves your hand and arm numb. That feeling passes after a moment, allowing the shard to be handled normally.\n\" -f \"***Frigid Touch (Simple Property).***|As an action, you scribe the *kalt* rune on the surface of any volume of water. The water freezes in a 10-foot radius around the spot where you scribed the rune.\n\" -f \"***Frost Friend (Simple Property).***|While you are attuned to this rune, you have resistance to fire damage.\n\" -f \"***Icy Mantle (Simple Property).***|As an action, you scribe the *kalt* rune using water onto yourself or another creature. The water instantly freezes into a mantle of protective ice that does not hinder movement or action. The next time the creature takes bludgeoning, slashing, or piercing damage, that damage is reduced to zero and the icy mantle is destroyed.\n\" -f \"***Freezing Bolt (Complex Property).***|As an action, you scribe this rune using water onto a creature within your reach as you expend a spell slot. The rune freezes in place, and the creature must make a Constitution saving throw (DC 12 + the level of the expended spell slot). On a failure, the creature takes 2d8 cold damage plus 1d8 cold damage per level of the expended spell slot, and its speed is reduced to 0 until the end of your next turn. On a successful saving throw, the creature takes half as much damage and its speed is not affected.\n\" -f \"***Ice Brand (Complex Property).***|Over the course of a short rest, you inscribe this rune using water onto a melee or ranged weapon, or onto up to 20 pieces of ammunition. The weapon or ammunition gains a ghostly white aura and deals cold damage instead of piercing, slashing, or bludgeoning damage.\n\nIn addition, you can expend a spell slot while using this property to grant the weapon or ammunition a bonus to attack rolls and damage rolls equal to the spell slot’s level divided by three.\n\nThese effects last for 24 hours or until you use this property again.\n\" -f \"***Winter’s Howl (Complex Property).***|While you are attuned to this rune, you can cast *sleet storm* as an action. You regain this ability after a short or long rest"}
]
