[
{"name":"Theurgy","type":"Subclass - Wizard","desc":"A number of deities claim arcane magic as their domain. While the idea of a divine being embracing such power might seem contradictory, magic is as much a part of the fabric of the cosmos as wind, fire, lightning, and all other primal forces. Just as there are deities of the sea and gods of warfare, the arcane arts feature their own divine patrons.\nSuch deities often have clerics, but many gods of magic bid their followers to take up the study of wizardry. These religious magic-users follow the arcane tradition of Theurgy, and are commonly known as theurgists. Such spellcasters are as dedicated and scholarly as any other wizard, but they blend their arcane study with religious teachings.\n\" -f \"**Divine Inspiration**|When you select this tradition at 2nd level, pick a divine domain from your chosen deity’s list of eligible domains. Alternatively, the following domains are thematically appropriate and easily compatible with the theurgist concept:\n- Arcana\n- Knowledge\n- Light\n\" -f \"**Arcane Initiate**|Beginning when you select this tradition at 2nd level, whenever you gain a wizard level, you can choose to replace one of the wizard spells you add to your spellbook with a cleric domain spell for your chosen domain. The spell must be of a level for which you have spell slots.\nIf you add all of your domain spells to your spellbook, you can subsequently opt to add any spell from the cleric spell list instead. The spell must still be of a level for which you have spell slots.\nOther wizards cannot copy cleric spells from your spellbook into their own spellbooks.\n\" -f \"**Channel Arcana**|At 2nd level, you gain the ability to channel arcane energy directly from your deity, using that energy to fuel magical effects. You start with two such effects: Divine Arcana and the Channel Divinity option granted at 2nd level by your chosen domain. You employ that Channel Divinity option by using your Channel Arcana ability.\nWhen you use your Channel Arcana, you choose which effect to create. You must then finish a short or long rest to use your Channel Arcana again.\nSome Channel Arcana effects require saving throws. When you use such an effect, the save DC equals your wizard spell save DC.\nBeginning at 6th level, you can use your Channel Arcana twice between rests, and beginning at 18th level, you can use it three times between rests. When you finish a short or long rest, you regain your expended uses.\nWhen you gain further uses for Channel Divinity from your domain, you can employ them by using your Channel Arcana ability.\n\" -f \"**Channel Arcana: Divine Arcana**|As a bonus action, you speak a prayer to control the flow of magic around you. The next spell you cast gains a +2 bonus to its attack roll or saving throw DC, as appropriate.\n\" -f \"**Arcane Acolyte**|At 6th level, you gain your chosen domain’s 1st-level benefits. However, you do not gain any weapon or armor proficiencies from your domain.\n\" -f \"**Arcane Priest**|At 10th level, you gain your chosen domain’s 6th-level benefits. Your faith and your understanding of magic allow you to delve into your god’s secrets.\n\" -f \"**Arcane High Priest**|At 14th level, you gain your chosen domain’s 17th-level benefits. Your academic nature and understanding of magic and doctrine allow you to master this ability sooner than a cleric of your domain."},
{"name":"Onomancy","type":"Subclass - Wizard","desc":"Practitioners of magic well know the power of names, but wizards who follow the tradition of Onomancy use their magic to manipulate the words that encompass existence. Onomancers expand their study into language itself, searching for threads of magical significance that weave through names. Something that is named stands out in the multiverse, distinct from the tapestry of creation all around it.\nThat distinction creates power that onomancers seek to tap. By speaking a target’s true name, the wizard’s spells slip between the cracks of the target’s defenses, conforming to its essential nature through the power of its name.To protect themselves, wizards who follow this tradition often hide their true names, typically by adopting monikers and pseudonyms.\n\" -f \"**Bonus Proficiencies**|*2nd-level Onomancy feature*\nYou learn one language of your choice and gain proficiency with calligrapher’s tools.\n\" -f \"**Extract Name**|*2nd-level Onomancy feature*\nYou can magically compel a creature to divulge its true name. As a bonus action, you target one creature you can see within 60 feet of you. The target must make a Wisdom saving throw against your spell save DC. On a successful save, you discern that this magic failed, and you can’t use this feature on the target again. On a failed save, the target is charmed by you until the end of your next turn, and you mentally learn the charmed target’s name or the fact that the target lacks a name.\nYou can use this feature a number of times equal to your Intelligence modifier (minimum of once), and you regain all expended uses of it when you finish a long rest.\n\" -f \"**Fateful Naming**|*2nd-level Onomancy feature*\nYou can bend magic to assist or hinder creatures through the power of their true names, and even use those names as an anchor to affect others around them. The bane and bless spells are wizard spells for you, and you add them to your spellbook. You always have them prepared, yet they don’t count against the number of spells you can prepare.\nYou can cast either spell without expending a spell slot if you speak the true name of one target of the spell as part of casting it. You can cast the spells in this way a number of times equal to your Intelligence modifier (a minimum of once), and you regain all expended uses when you finish a long rest.\n\" -f \"**Resonant Utterance**|*6th-level Onomancy feature*\nYou learn words of power called Resonants, which allow you to tailor your spells through the use of a target’s true name.\n***Resonants Known.*** When you gain this feature, you learn two Resonants of your choice, which are detailed in the “Resonant Options” section. Each time you gain a level in this class, you can replace one resonant you know with a different one.\n***Using a Resonant.*** You can use one Resonant when you cast a wizard spell with a spell slot and speak the true name of one creature targeted by the spell. Speaking the name is part of casting the spell.\nYou can use Resonants a number of times equal to half of your wizard level (round down), and you regain all expended uses when you finish a long rest.\n***Resonant Options.*** Here are your options when choosing a Resonant:\n\" -f \"- **Absorption.** When you cast a spell that deals damage to the named target, you gain 3d6 temporary hit points. The number of temporary hit points you gain increases by 1d6 when you reach 10th level (4d6) and 14th level (5d6) in this class.\n- **Devastation.** If the spell requires the named creature to make a saving throw, that creature has disadvantage on the first save it makes against the spell.\n- **Dissolution.** The first time the named creature takes damage from the spell, that creature takes an extra 2d8 force damage. The extra force damage increases by 1d8 when you reach 10th level (3d8) and 14th level (4d8) in this class.\n\" -f \"- **Nullification.** If the named target is affected by any other spells, you know what those spells are, and you can attempt to end one of your choice by succeeding on an Intelligence check with a DC equal to 10 + the level of the chosen spell.\n- **Puppetry.** The first time the named creature takes damage from the spell, you can knock the creature prone or move it up to 10 feet, either directly toward you or away from you.\n- **Sympathy.** If the named creature is within range of the spell, you can target the creature with the spell even if you can’t see the creature or it has total cover against the spell.\n\" -f \"**Inexorable Pronouncement**|*10th-level Onomancy feature*\nYou learn two new Resonants of your choice from your Resonant Utterance feature.\n\" -f \"**Relentless Naming**|*14th-level Onomancy feature*\nYou have learned how to bypass a named creature’s defenses against certain types of damage. When you cast a spell that deals damage to a creature whose true name you speak as part of casting the spell, you can cause the spell to deal force or psychic damage to the creature, instead of the spell’s normal damage type."},
{"name":"School of Invention","type":"Subclass - Wizard","desc":"The School of Invention claims credit for inventing the other schools of magic—a claim other wizards find absurd. Wizards of this school push magic to its limits. They stretch the known laws of arcane power and strive to reveal important truths about the nature of the multiverse.\nAdherents of this school believe that innovation is best served through experimentation. They have a reputation for acting first, thinking second. Most wizards are scholars who have mastered their craft through careful study, rigorous practice, and endless hours of repetition. These wizards would rather throw spells together and see what happens.\nMany wizards of this tradition are gnomes, alchemists, or both, and they take pride in the magic-infused armor they don. The armor not only provides protection, but it is also designed to help the wizard channel magic in unpredictable ways.\nWizards of this tradition are regarded as savants to their faces, but wizards of other traditions often think of them as lunatics.\n\" -f \"**Tools of the Inventor**|At 2nd level, you gain proficiency with two tools of your choice.\n\" -f \"**Arcanomechanical Armor**|Innovation is a dangerous practice, at least as far as members of this school practice it. As a shield against this risk, you have developed a suit of arcane armor.\nStarting at 2nd level, you gain proficiency with light armor and gain a suit of arcanomechanical armor—a magic item that only you can attune to. While you are attuned to it and wearing it, it grants you resistance to force damage.\nThe armor is light armor and provides an AC of 12 + your Dexterity modifier. It weighs 8 pounds.\nYou can create a new suit of it at the end of a long rest by touching a nonmagical suit of studded leather armor, which magically transforms it. Doing so removes the magic from your previous arcanomechanical armor, turning it into nonmagical studded leather.\n\" -f \"**Reckless Casting**|Starting at 2nd level, you can attempt to cast a spell you don’t have prepared. When you use this ability, you use your action and choose one of the following options:\n- Roll on the Reckless Casting table for cantrips and cast the resulting spell as part of this action.\n- Expend a spell slot and roll twice on the Reckless Casting table for its level, or the 5th-level table if the slot is 6th level or higher. Pick which of the two results you want to use and cast the resulting spell as part of this action.\nIf the spell you cast isn’t a wizard spell, it is nonetheless a wizard spell for you when you cast it with this feature.\n\" -f \"**Alchemical Casting**|At 6th level, you learn to channel magic through your arcanomechanical armor to augment spells in a variety of ways. When you cast a spell while wearing that armor and attuned to it, you can expend one additional spell slot of 1st or 2nd level to alter the spell. The effect depends on the spell slot you expend.\nA 1st-level slot allows you to manipulate the spell’s energy. When you cast a spell that deals acid, cold, fire, lightning, or thunder damage, you can substitute that damage type for another one from that list.\nA 2nd-level slot increases the spell’s raw force. If you roll damage for the spell when you cast it, increase that damage by 2d10 force damage against one of the spell’s targets (your choice) this turn.\n\" -f \"**Prodigious Inspiration**|At 10th level, you have attained a greater mastery of spell preparation. As a bonus action, you can replace one spell you have prepared with another spell from your spellbook. You can’t use this ability again until you finish a short or long rest.\n\" -f \"**Controlled Chaos**|At 14th level, your ability to improvise magic grows stronger. Whenever you roll on a Reckless Casting table for a spell other than a cantrip, you can roll on the table that is one level higher than the expended spell slot."},
{"name":"Reckless Casting table","type":"Table - School of Invention","desc":"```d10 | Cantrip\n----|----------------\n1   | acid splash\n2   | chill touch\n3   | fire bolt\n4   | light\n5   | poison spray\n6   | ray of frost\n7   | shocking grasp\n8   | sacred flame\n9   | thorn whip\n10  | Roll twice and cast each cantrip, but if you roll another 10 on either die, you cast nothing, wasting your action.```\n\" -f \"1st Level|```d10 | 1st-Level Spell\n----|---------------\n1   | burning hands\n2   | chromatic orb\n3   | color spray\n4   | faerie fire\n5   | false life\n6   | fog cloud\n7   | jump\n8   | magic missile\n9   | thunderwave\n10  | Roll twice and cast each spell, but if you roll another 10 on either die, you cast nothing, wasting your action but not the spell slot.```\n\" -f \"2nd Level|```d10 | 2nd-Level Spell\n----|-------------------\n1   | blur\n2   | darkness\n3   | enlarge/reduce\n4   | gust of wind\n5   | invisibility\n6   | levitate\n7   | Melf’s acid arrow\n8   | scorching ray\n9   | shatter\n10  | Roll twice and cast each spell, but if you roll another 10 on either die, you cast nothing, wasting your action but not the spell slot.```\n\" -f \"3rd Level|```d10 | 3rd-Level Spell\n----|----------------\n1   | blink\n2   | fear\n3   | feign death\n4   | fireball\n5   | fly\n6   | gaseous form\n7   | lightning bolt\n8   | sleet storm\n9   | stinking cloud\n10  | Roll twice and cast each spell, but if you roll another 10 on either die, you cast nothing, wasting your action but not the spell slot.```\n\" -f \"4th Level|```d10 | 4th-Level Spell\n----|-------------------------\n1   | blight\n2   | confusion\n3   | Evard’s black tentacles\n4   | fire shield\n5   | greater invisibility\n6   | ice storm\n7   | phantasmal killer\n8   | stoneskin\n9   | wall of fire\n10  | Roll twice and cast each spell, but if you roll another 10 on either die, you cast nothing, wasting your action but not the spell slot.```\n\" -f \"5th Level|```d10 | 5th-Level Spell\n----|------------------\n1   | cloudkill\n2   | cone of cold\n3   | destructive wave\n4   | flame strike\n5   | hold monster\n6   | insect plague\n7   | mass cure wounds\n8   | wall of force\n9   | wall of stone\n10  | Roll twice and cast each spell, but if you roll another 10 on either die, you cast nothing, wasting your action but not the spell slot.```"},
{"name":"Rune Scribe","type":"Prestige Class","desc":"Consult the [Allowed UA Document](https://bit.ly/3u73Iu7) on how to use Prestige Classes.\n\" -f \"**The Rune Scribe**|```Level | Features                      | 1st | 2nd | 3rd\n1st   | Rune Lore, Runic Magic        | 2   | —   | —\n2nd   | Runic Discovery               | 3   | —   | —\n3rd   | Runic Discovery               | 4   | 2   | —\n4th   | Living Rune                   | 4   | 3   | —\n5th   | Rune Mastery, Runic Discovery | 4   | 3   | 2```\n\" -f \"**Prerequisites**|In order to advance as a rune scribe, you must meet the following prerequisites (in addition to the multiclassing prerequisites for your existing class):\n- **Dexterity 13**. Rune scribes need agile fingers to master the intricate patterns of a rune.\n- **Intelligence 13**. Rune lore requires intense study and knowledge.\n- **Proficiency in the Arcana skill**. Rune mastery requires an understanding of arcane lore.\n- **Character level 5th**. Rune magic awakens only for powerful souls, and you must be a 5th-level character before you can gain levels in the rune scribe prestige class.\n- **Complete a special task**. You must find a rune and present it to an NPC rune scribe who accepts it in return for tutoring you in the ways of rune magic. You cannot gain more levels in this prestige class than your tutor has. You might need to seek out additional runes and present them to more skilled rune scribes in order to reach 5th level in this prestige class.\n\" -f \"**Hit Points**|**Hit Dice:** 1d8 per rune scribe level\n**Hit Points per Level:** 1d8 (or 5) + your Constitution modifier per rune scribe level\n\" -f \"**Proficiencies**|**Tools:** Calligrapher’s supplies, mason’s tools, woodcarver’s tools\n**Saving Throws:** None\n**Skills:** None\n\" -f \"**Rune Lore**|At 1st level, you learn the basics of scribing runes, and are able to activate a master rune’s full range of properties when you are properly attuned to it. The “Rune Magic” section below contains information on master runes and descriptions of runes and their properties.\nThe first rune you master is the rune you found and presented to your tutor to qualify for this prestige class. Your entrance to the class includes the process of mastering that rune’s secrets.\n\" -f \"**Runic Magic**|Runes can make use of your own magical power to augment some of their effects. You gain a number of spell slots as specified on the Rune Scribe table, but this prestige class does not grant spells known.\nInstead, as a rune scribe, you can expend your spell slots to empower runes, as described in the “Rune Magic” section (available through this command).\nFor the purpose of multiclassing, to determine your total spell slots, add your levels in rune scribe to your levels in classes that grant you the Spellcasting feature. For example, if you are a rune scribe 4/wizard 6, you would have the spell slots of a 10th-level character, in addition to having the cantrips and spellbook of a 6th-level wizard.\n\" -f \"**Runic Discovery**|Your continuing study of runic magic allows you to recreate the secrets of new runes without first needing to uncover them. At 2nd, 3rd, and 5th level, choose a rare rune. You can attune to that rune even if you do not possess the master rune for it. (See the “Rune Magic” section below for information on rune rarity and master runes.) In order to attune to a rune in this manner, you must spend a short rest doing nothing but meditating on the rune. At the end of the short rest, you are attuned to the rune. You are considered to always have the rune on your person for the purpose of determining whether you can use its features.\nYou can spend another short rest doing nothing but meditating on the rune to end your attunement to it.\n\" -f \"**Living Rune**|Runes are a part of the living world, and your studies allow you to connect to their magic in increasingly powerful ways. At 4th level, you learn to incorporate rune magic into your identity, allowing you to augment your body and mind.\nAt the end of a long rest, you can choose to increase one ability score of your choice by 2 or increase two ability scores of your choice by 1. At the end of each subsequent long rest, you can alter this choice, reducing the scores you previously increased and improving different scores. (If you chose to increase two abilities, you can opt to alter only one of those choices.)\n\" -f \"**Rune Mastery**|At 5th level, you attain the ability to master an ever-greater range of runic magic. When you attune to a rune, you can choose to have it not count toward your limit of attuned magic items.\nYou can be attuned to only one such rune in this manner at a time. You can use this ability again after you end your attunement to a rune."},
{"name":"Rune Magic","type":"Other","desc":"Rune magic allows a character to unlock the power contained within magical symbols and sigils. Not every such mark has the potential for power. Only those runes forged in the ancient days of creation still resonate with the fundamental magic of the world.\nRunes work much like magic items. You can discover them, attune to them, and use their magic in a variety of ways. However, unlike with magic items, only a rune scribe can use all the benefits a rune offers.\n\" -f \"**Overview**|Runes are powerful icons that you can use for a variety of effects. In order to use a rune, you must normally find and keep a **master rune**. A master rune is a rare object—a gem or carved rock, a magical token, a shard of some special material, and so on—engraved with the rune and empowered with magic that allows you to unleash the rune’s effects. Those effects are divided into two categories.\n**Simple properties** are usable by anyone who attunes to a master rune.\n**Complex properties** are usable only by a character who attunes to a master rune and who possesses the Rune Lore class feature.\nUnless otherwise noted, you must have a master rune on your person in order to use its properties.\n\" -f \"**Finding Runes**|A rune found as treasure is a master rune, carefully scribed into a rare object and available for use as a training tool to allow would-be rune scribes to unlock its power. Each rune discussed below is detailed as part of a master rune.\nMaster runes and the runes they contain are treated much like magic items. They are categorized in rarity from rare to legendary, and can be placed in a campaign whenever the DM opts to place treasure. There are no common or uncommon runes.\n\" -f \"**Buying and Selling Runes**|Treat a master rune as a magic item of its equivalent rarity for the purpose of buying and selling in the campaign. Just as with other magic items, the DM will determine whether such items are available to purchase in the campaign and under what conditions.\n\" -f \"**Identifying Runes**|Runes are identified in a manner similar to magic items. Simply handling a master rune causes a strong sense of its rune’s identity to echo in a character’s mind. For example, touching a master rune item containing the *kalt* rune (the rune of cold) might cause you to experience a sudden chill as visions of snow and ice flash through your mind.\nThe *identify* spell immediately reveals a master rune’s simple properties. You can also learn its simple properties over the course of a short rest while maintaining physical contact with the rune.\n\" -f \"**Runes and Attunement**|A rune always requires attunement to use its simple properties. Attuning to a master rune requires you to spend a short rest focused on only that item while being in physical contact with it. This can’t be the same short rest used to learn the rune’s properties. This focus takes the form of carefully and repeatedly copying the rune, whether with ink and parchment or simply scribing it into the dirt. If the short rest is interrupted, the attunement attempt fails. Otherwise, at the end of the short rest, you gain an intuitive understanding of how to activate the rune’s magical properties.\nA master rune can be attuned to only one creature at a time, and all runes count toward your limit of magic items you can attune to. Any attempt to attune to a fourth magic item or rune fails (though a rune scribe’s Rune Mastery feature allows attunement to one additional rune). You cannot attune to more than one copy of a rune.\nYou can end attunement to a rune in the same manner as with any other magic item."},
]
